[
  {
    "title": "Our Favorite Afropop Moments of 2025 So Far",
    "description": "Our favorite Afropop moments of 2025 so far: from Tems’ money moves to African stars rocking Coachella",
    "publishedAt": "2025-06-30T21:32:30Z",
    "source": "Rolling Stone",
    "url": "http://www.rollingstone.com/music/music-features/made-in-africa-best-moments-of-2025-so-far-1235375905/",
    "content": "We’re officially halfway through 2025, and it’s truly giving “It was the best of times, it was the worst of times.” This month’s column is going to lean into the good – a few Afropop moments of innov… [+8273 chars]"
  },
  {
    "title": "Bozdağ Film Platolari in İstanbul, Turkey",
    "description": "The hit television series \"Diriliş: Ertuğrul,\" (2014) and its sequel \"Kuruluş: Osman,\" (2019) are two of the most popular shows to come out of Turkey. The first is based on the life of historical figure Ertuğrul and the sequel tells the story of his son Osman…",
    "publishedAt": "2025-06-30T20:30:00Z",
    "source": "Atlas Obscura",
    "url": "https://www.atlasobscura.com/places/bozdag-film-platolari",
    "content": "The hit television series \"Dirili: Erturul,\" (2014) and its sequel \"Kurulu: Osman,\" (2019) are two of the most popular shows to come out of Turkey. The first is based on the life of historical figure… [+1485 chars]"
  },
  {
    "title": "The Fungus That May Have Caused The ‘Curse Of King Tut’s Tomb’ Just Showed Promising Results In Treating Cancer",
    "description": "Researchers at the University of Pennsylvania isolated select molecules from the fungus Aspergillus flavus and turned them into a \"cancer-killing compound that rivals FDA-approved drugs.\"\nThe post The Fungus That May Have Caused The ‘Curse Of King Tut’s Tomb’…",
    "publishedAt": "2025-06-30T19:45:37Z",
    "source": "Allthatsinteresting.com",
    "url": "https://allthatsinteresting.com/king-tut-curse-fungus-cancer-treatment",
    "content": "Researchers at the University of Pennsylvania isolated select molecules from the fungus Aspergillus flavus and turned them into a \"cancer-killing compound that rivals FDA-approved drugs.\"\r\nWikimedia … [+4591 chars]"
  },
  {
    "title": "Now It’s Murder: First Victim of Illegal Immigrant’s Molotov Attack on Jewish Group Dies",
    "description": "\"Investigators say Soliman told them he intended to kill the roughly 20 participants at the weekly demonstration on Boulder’s Pearl Street pedestrian mall.\"\nThe post Now It’s Murder: First Victim of Illegal Immigrant’s Molotov Attack on Jewish Group Dies firs…",
    "publishedAt": "2025-06-30T19:32:36Z",
    "source": "Legalinsurrection.com",
    "url": "https://legalinsurrection.com/2025/06/now-its-murder-first-victim-of-illegal-immigrants-molotov-attack-on-jewish-group-dies/",
    "content": "Karen Diamond, 81, has died “as a result of the severe injuries that she suffered” when Mohamed Sabry Soliman, an Egyptian national in the U.S. illegally, allegedly hurled Molotov cocktails at a grou… [+4384 chars]"
  },
  {
    "title": "Amazing Archaeological Discoveries (40 PICS)",
    "description": "Amazing Archaeological Discoveries  (40 PICS)",
    "publishedAt": "2025-06-30T18:53:35Z",
    "source": "Izismile.com",
    "url": "https://izismile.com/2025/06/30/amazing_archaeological_discoveries_40_pics.html",
    "content": "\"The Double Statue Of Mephistopheles And Margarita\"\r\n\"Perhaps one of the most incredible sculptures in the world. There is a well-known sculpture called \"The Double Statue of Mephistopheles and Marga… [+10766 chars]"
  },
  {
    "title": "82-Year-Old Jewish Woman Dies From Injuries Suffered in Anti-Semitic Colorado Terror Attack",
    "description": "An 82-year-old Jewish woman who suffered severe injuries during an anti-Semitic firebombing attack early June in Boulder, Colo., has died, prompting prosecutors to file first-degree murder and more hate crime charges on Monday against suspect Mohamed Soliman.…",
    "publishedAt": "2025-06-30T18:30:04Z",
    "source": "Washington Free Beacon",
    "url": "https://freebeacon.com/latest-news/82-year-old-jewish-woman-dies-from-injuries-suffered-in-anti-semitic-colorado-terror-attack/",
    "content": "An 82-year-old Jewish woman who suffered severe injuries during an anti-Semitic firebombing attack early June in Boulder, Colo., has died, prompting prosecutors to file first-degree murder and more h… [+2258 chars]"
  },
  {
    "title": "Amman’s Pitching Platforms Titles Catches the Range, Depth and Nuance of New Titles from Emerging Arab World Talent",
    "description": "Lina Soualem’s Spain-set family tale “Alicante,” “Asphalt,” the big winner at this year’s Cannes Docs-in-Progress, and “Printemps,” from Berlin laureates Noel and Michelle Keserwany, look like potential standouts at this year’s Amman Intl. Film Festival’s Pit…",
    "publishedAt": "2025-06-30T17:55:00Z",
    "source": "Variety",
    "url": "https://variety.com/2025/film/global/amman-film-festival-lina-soualem-1236443972/",
    "content": "Lina Soualem’s Spain-set family tale “Alicante,” “Asphalt,” the big winner at this year’s Cannes Docs-in-Progress, and “Printemps,” from Berlin laureates Noel and Michelle Keserwany, look like potent… [+13106 chars]"
  },
  {
    "title": "At least 58 killed as Israel intensifies offensive in Gaza",
    "description": "Despite hopes of a ceasefire between Israel and Hamas, the Israeli Defense Force stepped up its latest offensive in the Palestinian enclave on Monday.",
    "publishedAt": "2025-06-30T17:46:27Z",
    "source": "ABC News (AU)",
    "url": "https://www.abc.net.au/news/2025-07-01/israeli-bombardment-in-gaza-kills-58-people-in-one-day/105479464",
    "content": "A beachfront cafe and four schools were among the targets struck as Israel intensified its latest campaign against Hamas in Gaza, killing at least 58 people on Monday alone.\r\nThe strikes came as Isra… [+7017 chars]"
  },
  {
    "title": "A Story About Farting 2 – Ancient Egypt’s Gassy Apocalypse is Coming",
    "description": "Hey fellow gamers,We’re excited (and slightly horrified) to reveal our new project: A Story About Farting 2. If you thought the first game was absurd, you have no idea what’s coming.This time, the saga takes place in Ancient Egypt. You’ll step into the sandal…",
    "publishedAt": "2025-06-30T17:36:46Z",
    "source": "Gamedev.net",
    "url": "https://www.gamedev.net/blogs/entry/2295851-a-story-about-farting-2-ancient-egypts-gassy-apocalypse-is-coming",
    "content": "Hey fellow gamers,\r\nWere excited (and slightly horrified) to reveal our new project: A Story About Farting 2. If you thought the first game was absurd, you have no idea whats coming.\r\nThis time, the … [+1467 chars]"
  },
  {
    "title": "The 10 Most Stylish Handheld Fans to Look and Feel Cool This Summer",
    "description": "Our guide to stylish handheld fans, including the best folding fans trending on TikTok for keeping cool.",
    "publishedAt": "2025-06-30T17:10:45Z",
    "source": "WWD",
    "url": "http://wwd.com/shop/shop-fashion/best-handheld-fans-1237955595/",
    "content": "If you purchase an independently reviewed product or service through a link on our website, WWD may receive an affiliate commission.\r\nIf the heat wave that tore through the country last week proved a… [+10157 chars]"
  },
  {
    "title": "What’s Going On At HGTV? Another Series Got Canceled, And It’s The Fourth Time It’s Happened Recently",
    "description": "HGTV's lineup is lighter than it was a few weeks ago.",
    "publishedAt": "2025-06-30T16:57:24Z",
    "source": "CinemaBlend",
    "url": "https://www.cinemablend.com/television/fourth-hgtv-series-recently-canceled-farmhouse-fixer-jonathan-knight",
    "content": "It's safe to say that HGTV's lineup of original series looked very different when the 2025 TV premiere schedule started up, at least compared to how it looks now. The cable network has made several u… [+5415 chars]"
  },
  {
    "title": "Gabe's Reading List",
    "description": "I start tons of books using the Kindle preview but end up actually buying and finishing far fewer. I lean towards hard Sci-Fi. I like inscrutable alien artifacts and massive jumps through time. If I’m not reading about spaceships I’m reading history books for…",
    "publishedAt": "2025-06-30T16:55:00Z",
    "source": "Penny-arcade.com",
    "url": "https://www.penny-arcade.com/news/post/2025/06/30/gabe-s-reading-list",
    "content": "I start tons of books using the Kindle preview but end up actually buying and finishing far fewer. I lean towards hard Sci-Fi. I like inscrutable alien artifacts and massive jumps through time. If I’… [+1688 chars]"
  },
  {
    "title": "Scribble-based forecasting and AI 2027",
    "description": "math or intuition?",
    "publishedAt": "2025-06-30T16:15:29Z",
    "source": "Dynomight.net",
    "url": "https://dynomight.net/scribbles/",
    "content": "AI 2027 forecasts true AGI could plausibly arrive as early as 2027. I recently spent some time looking at both the timelines forecast and some critiques [1, 2, 3].\r\nInitially, I was interested in tec… [+11182 chars]"
  },
  {
    "title": "Israel kills 85 Palestinians, bombing across Gaza amid new ceasefire push",
    "description": "Homes, schools, hospitals and hungry aid seekers targeted by Israel as it forces thousands out of the enclave's north.",
    "publishedAt": "2025-06-30T16:12:59Z",
    "source": "Al Jazeera English",
    "url": "https://www.aljazeera.com/news/2025/6/30/israel-kills-85-palestinians-bombing-across-gaza-amid-new-ceasefire-push",
    "content": "Israeli forces have bombarded multiple areas across the besieged Gaza Strip, killing at least 85 Palestinians, including aid seekers and families sheltering in schools, and wounding many more in atta… [+5725 chars]"
  },
  {
    "title": "The gay Wimbledon tennis star turned spy who was imprisoned by the Nazis",
    "description": "As we prepare to be inundated with the strawberries and cream Instagram stories of Wimbledon, did you know the tennis tournament has a poignant place in gay history? Although you may be more familiar with the sport’s trailblazing gay Grand Slam champions Bill…",
    "publishedAt": "2025-06-30T16:07:08Z",
    "source": "Thepinknews.com",
    "url": "https://www.thepinknews.com/2025/06/30/gay-wimbledon-finalist-gottfried-von-cramm/",
    "content": "As we prepare to be inundated with the strawberries and cream Instagram stories of Wimbledon, did you know the tennis tournament has a poignant place in gay history?\r\nAlthough you may be more familia… [+3219 chars]"
  },
  {
    "title": "The Iran-Israel War Is Over. But the Arab World Is Grappling With Its Consequences",
    "description": "The region is relieved about de-escalation. But it is also alarmed about an unrestrained Israel, writes H.A. Hellyer.",
    "publishedAt": "2025-06-30T16:03:20Z",
    "source": "Time",
    "url": "https://time.com/7298676/iran-israel-conflict-arab-reaction/",
    "content": "The Iran-Israel ceasefire seems to be holding. Arab capitals are relieved about the de-escalation. But they are also alarmed about what the latest flare up means for the Middle East. \r\nWhen Iran sign… [+4040 chars]"
  },
  {
    "title": "More than 100 Items in the British Royal Regalia Symbolize Power and Tradition Through the Ages",
    "description": "What is the British Royal Regalia? Learn more about the British Crown Jewels and how they are replaced medieval renditions after anti-monarchists destroyed them.",
    "publishedAt": "2025-06-30T16:00:00Z",
    "source": "Discover Magazine",
    "url": "https://www.discovermagazine.com/the-sciences/more-than-100-items-in-the-british-royal-regalia-symbolize-power-and",
    "content": "Key Takeaways on the British Royal Regalia\r\n<ul><li>The British Royal Regalia signifies power and legitimacy of rulers. Worn at coronation ceremonies, the British Crown Jewels includes more than 100 … [+7430 chars]"
  },
  {
    "title": "Trump pressures Israel to end Gaza conflict as he eyes Abraham Accords expansion",
    "description": "Trump urges Israel to \"make the deal in Gaza\" as envoy Ron Dermer heads to White House meetings, while Israel claims Hamas blocks return of 50 hostages held since Oct. 7.",
    "publishedAt": "2025-06-30T15:55:58Z",
    "source": "Fox News",
    "url": "https://www.foxnews.com/world/trump-pressures-israel-end-gaza-conflict-he-eyes-abraham-accords-expansion",
    "content": "President Donald Trump is leaning on Israel to end its conflict in Gaza and secure a hostage deal as he looks to expand the Abraham Accords a cornerstone achievement of his first term.\r\nThe pressure … [+3168 chars]"
  },
  {
    "title": "Today in History: July 15, discovery of the Rosetta Stone",
    "description": "Today in History\nToday is Tuesday, July 15, the 196th day of 2024. There are 169 days left in the year.\nToday in History:\nOn July 15, 1799, the Rosetta Stone, a key to deciphering ancient Egyptian scripts, was found at Fort Julien in the Nile Delta during the…",
    "publishedAt": "2025-06-30T15:25:41Z",
    "source": "seattlepi.com",
    "url": "https://www.seattlepi.com/news/article/today-in-history-july-15-discovery-of-the-20400700.php",
    "content": "Today in History\r\nToday is Tuesday, July 15, the 196th day of 2024. There are 169 days left in the year.\r\nToday in History:\r\nAdvertisement\r\nArticle continues below this ad\r\nOn July 15, 1799, the Rose… [+3654 chars]"
  },
  {
    "title": "PM Oli holds bilateral meetings with Egyptian and Portuguese counterparts in Spain",
    "description": "KATHMANDU: Prime Minister KP Sharma Oli held separate bilateral meetings with the Prime Minister of Egypt, Dr. Mostafa Kamal Madbouly, and the Prime Minister of Portugal, Luís Montenegro, on the sidelines of the Fourth International Conference on Financing fo…",
    "publishedAt": "2025-06-30T15:14:49Z",
    "source": "Khabarhub.com",
    "url": "https://english.khabarhub.com/2025/30/481780/",
    "content": "KATHMANDU: Prime Minister KP Sharma Oli held separate bilateral meetings with the Prime Minister of Egypt, Dr. Mostafa Kamal Madbouly, and the Prime Minister of Portugal, Luís Montenegro, on the side… [+786 chars]"
  },
  {
    "title": "Jennifer Lopez Gearing Up to Launch Overseas Run of Up All Night Tour",
    "description": "Jennifer Lopez gearing up for July 8 launch of the overseas run of her Up All Night tour, slated to kick off with the first of seven shows in Spain.",
    "publishedAt": "2025-06-30T14:54:24Z",
    "source": "Billboard",
    "url": "http://www.billboard.com/music/pop/jennifer-lopez-dates-2025-up-all-night-overseas-tour-1236010451/",
    "content": "Jennifer Lopez is gearing up to keep her overseas fans Up All Night. The singer/actress took to her socials on Sunday (June 29) to hype the upcoming outing slated to hit Europe, the Middle East and C… [+2713 chars]"
  },
  {
    "title": "Air Cairo Sets New Benchmark for African Airlines: Enhances In-Flight Medical Safety with MedAire Partnership",
    "description": "Strategic Alliance with MedAire Aligns with Egypt's Vision for Modernised Aviation Safety and Healthcare Standards Strategic Alliance with MedAire Aligns with Egypt's Vision for Modernised Aviation Safety and Healthcare Standards",
    "publishedAt": "2025-06-30T14:38:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/06/30/3107660/0/en/Air-Cairo-Sets-New-Benchmark-for-African-Airlines-Enhances-In-Flight-Medical-Safety-with-MedAire-Partnership.html",
    "content": "Cairo, Egypt, June 30, 2025 (GLOBE NEWSWIRE) -- Air Cairo, one of Egypt's leading airlines, has partnered strategically with MedAire, the global leader in aviation medical and security support, to en… [+4570 chars]"
  },
  {
    "title": "Turkey-Libya Memorandum: Ankara’s influence over Libya’s warlords a double threat to Greece",
    "description": "Athens is preparing for a “dangerous mission” amid the volatile landscape in Libya, as developments regarding maritime zones and migration leave Greece no choice but to engage more directly with this crucial North African neighbor\nThe post Turkey-Libya Memora…",
    "publishedAt": "2025-06-30T14:28:54Z",
    "source": "Protothema.gr",
    "url": "https://en.protothema.gr/2025/06/30/turkey-libya-memorandum-ankaras-influence-over-libyas-warlords-a-double-threat-to-greece/",
    "content": "Over the weekend, beyond the harsh exchanges between Athens and Ankara over the Turkey-Libya Memorandum which the EU condemned as illegal negative signals also emerged from Eastern Libya. The Prime M… [+7127 chars]"
  },
  {
    "title": "Superior growth performance in carp fry achieved with chitosan-alginate encapsulated A-ghrelin versus free peptide: Evidence from physiological, molecular, and morphological analyses",
    "description": "This study investigates the potential of delivering ghrelin via chitosan-alginate (Cs-Al) nanocapsules to enhance growth performance, immune function, and stress biomarker parameters in common carp fry (Cyprinus carpio). Characterization of the nanoparticles …",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327235",
    "content": "Abstract\r\nThis study investigates the potential of delivering ghrelin via chitosan-alginate (Cs-Al) nanocapsules to enhance growth performance, immune function, and stress biomarker parameters in com… [+44523 chars]"
  },
  {
    "title": "Interpretable machine learning for predicting isolated basal septal hypertrophy",
    "description": "Background The basal septal hypertrophy(BSH) is an often under-recognized morphological change in the left ventricle. This is a common echocardiographic finding with a prevalence of approximately 7–20%, which may indicate early structural and functional remod…",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0325992",
    "content": "Citation: Gao L, Tian B, Jia Q, He X, Zhao G, Wang Y (2025) Interpretable machine learning for predicting isolated basal septal hypertrophy. PLoS One 20(6):\r\n e0325992.\r\nhttps://doi.org/10.1371/journ… [+25332 chars]"
  },
  {
    "title": "Closing The Strait Of Hormuz Will Be A Nightmare Scenario For The Global Economy",
    "description": "Our way of life depends on cheap energy.  If you remove cheap energy from the equation, our society will be thrown into a state of chaos.  The Iranians know that closing the Strait of Hormuz is one of the most powerful forms of leverage that they possess, bec…",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Activistpost.com",
    "url": "https://www.activistpost.com/closing-the-strait-of-hormuz-will-be-a-nightmare-scenario-for-the-global-economy/",
    "content": "Our way of life depends on cheap energy.  If you remove cheap energy from the equation, our society will be thrown into a state of chaos.  The Iranians know that closing the Strait of Hormuz is one o… [+8254 chars]"
  },
  {
    "title": "Here's Everything Coming to Disney+ Canada in July 2025",
    "description": "Schools are on summer vacation, and so is Disney+! The streamer has revealed its July 2025 lineup, and it includes a whole lotta nothing",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Exclaim!",
    "url": "https://exclaim.ca/film/article/here-s-everything-coming-to-disney-canada-in-july-2025",
    "content": "Schools are on summer vacation, and so is Disney+! The streamer has revealed its July 2025 lineup, and it includes a whole lotta nothing much.\r\nThis not-that-remarkable lineup includes the launch of … [+2832 chars]"
  },
  {
    "title": "Knowledge and attitudes towards Alzheimer’s disease among adult residents in Jiulongpo, Chongqing, China: A cross-sectional survey",
    "description": "Background The prevalence of Alzheimer’s disease (AD) continues to rise as the aging population increases, and the resulting cognitive decline severely affects patients’ quality of life. However, the public’s understanding of AD is markedly insufficient, whic…",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327346",
    "content": "Abstract\r\nBackground\r\nThe prevalence of Alzheimers disease (AD) continues to rise as the aging population increases, and the resulting cognitive decline severely affects patients quality of life. How… [+34990 chars]"
  },
  {
    "title": "‘Sinners’ and ‘The Studio’ Among Nominations for Location Managers Guild International Awards",
    "description": "“Sinners,” “Conclave,” “The Day of the Jackal” and “The Studio” are among the movies and television shows nominated for the Location Managers Guild International awards. The 12th annual LMGI Awards are set for Aug. 23 and will be presented at The Eli and Edyt…",
    "publishedAt": "2025-06-30T13:30:00Z",
    "source": "Variety",
    "url": "https://variety.com/2025/artisans/news/location-managers-guild-international-awards-nominations-2025-1236443174/",
    "content": "“Sinners,” “Conclave,” “The Day of the Jackal” and “The Studio” are among the movies and television shows nominated for the Location Managers Guild International awards.\r\nThe 12th annual LMGI Awards … [+2700 chars]"
  },
  {
    "title": "Location Managers Guild Reveals 2025 LMGI Awards Nominations",
    "description": "The Location Managers Guild International is out with the nominations for its 12th LMGI Awards, which honor the outstanding and creative visual contributions by location professionals in film, TV and commercials worldwide. See the list below. The LMGI Awards …",
    "publishedAt": "2025-06-30T13:30:00Z",
    "source": "Deadline",
    "url": "http://deadline.com/2025/06/lmgi-awards-nominations-2025-list-1236444995/",
    "content": "The Location Managers Guild International is out with the nominations for its 12th LMGI Awards, which honor the outstanding and creative visual contributions by location professionals in film, TV and… [+2452 chars]"
  },
  {
    "title": "Princess Diana’s favourite café risks closure over ‘illegal migrant workers and paying staff in food’",
    "description": "Café Diana, which was often frequented by the late Princess of Wales, also accused of allowing unlawful smoking of shisha",
    "publishedAt": "2025-06-30T13:27:17Z",
    "source": "The-independent.com",
    "url": "https://www.the-independent.com/news/uk/home-news/princess-diana-cafe-illegal-migrants-b2779517.html",
    "content": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+4026 chars]"
  },
  {
    "title": "The End of Modernity",
    "description": "A crisis is unfolding before our eyes—and also in our heads.",
    "publishedAt": "2025-06-30T12:10:32Z",
    "source": "Foreign Policy",
    "url": "http://foreignpolicy.com/2025/06/30/modernity-globalization-politics-history/",
    "content": "This year, Europe celebrated the 80th anniversary of the end of World War II and the beginning of what came next. The declaration of Austrian independence on April 27, 1945, marked an early step out … [+23871 chars]"
  },
  {
    "title": "Everything Coming to Netflix, Disney+ & Other Streaming Services in July 2025",
    "description": "We’re just under a week away from the start of July, and the arrival of a new month means a slew of new options in the world of streaming. All of the major streaming services regularly turn over their rosters at the start of a month and July is no exception t…",
    "publishedAt": "2025-06-30T12:00:00Z",
    "source": "ComicBook.com",
    "url": "http://comicbook.com/movies/news/new-streaming-movies-tv-shows-july-2025-netflix-disney-plus-hbo-max-services/",
    "content": "We’re just under a week away from the start of July, and the arrival of a new month means a slew of new options in the world of streaming. All of the major streaming services regularly turn over thei… [+22660 chars]"
  },
  {
    "title": "Israel steps up Gaza bombardment ahead of White House talks on ceasefire",
    "description": "IDF tanks push into Gaza City suburb and shell northern areas, say residents, while aircraft bomb schools",
    "publishedAt": "2025-06-30T11:56:34Z",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/middle-east/2025/06/30/israel-steps-up-gaza-bombardment-ahead-of-white-house-talks-on-ceasefire/",
    "content": "Palestinians in northern Gaza reported one of the worst nights of Israeli bombardment in weeks after the military issued mass evacuation orders on Monday, while Israeli officials were due in Washingt… [+3360 chars]"
  },
  {
    "title": "5⭐️ ALL-INCLUSIVE Egypt family holiday with ✈️",
    "description": "Pirates, we might be enjoying a heatwave right now in the UK, but it won't be long til the weather takes a turn and winter arrives - sorry. Get some Winter sun booked up with this luxury holiday to Egypt we have come across, at a bargain price.You will be sta…",
    "publishedAt": "2025-06-30T11:36:48Z",
    "source": "Holidaypirates.com",
    "url": "https://www.holidaypirates.com/packages/parrotel-lagoon-resort-sharm-el-sheikh-red-sea-egypt",
    "content": "We might be pirates, but were an honest bunch. We check all our deals when we review them to make sure everything is available. However, with deals this hot, things change quicklyflight prices fluctu… [+462 chars]"
  },
  {
    "title": "Dynamic First Jewelry Collection By Tonya Hawkes Launches In Paris",
    "description": "World-renowned luxury handbag designer Tonya Hawkes is launching her first jewelry collection at L’Atelier Paris through July 2, 2025, where she is showing 27 pieces.",
    "publishedAt": "2025-06-30T11:10:00Z",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/kyleroderick/2025/06/30/dynamic-first-jewelry-collection-by-tonya-hawkes-launches-in-paris/",
    "content": "The Diana Selene medallion necklace and the Tegen and Heli bracelets are studded with amazonite. The ... More castle ring embodies amazonite, garnets and black agate.\r\nTonya Hawkes\r\nSince she founded… [+4156 chars]"
  },
  {
    "title": "Your Next Shirt Could Come From CO2 – The New Worlds Of Fashion, Food",
    "description": "“We harness the power of the tiny microbe,\" she said, presenting a white t-shirt & a pair of fuchsia leggings made from captured CO2, she said. Is this the future?",
    "publishedAt": "2025-06-30T11:00:00Z",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/joanmichelson2/2025/06/30/your-next-shirt-could-made-from-co2--the-new-world-of-food-and-fashion/",
    "content": "Zara Summers w CO2 T-shirt &amp; Joan - ED Women's Summit - 4-22-2025\r\nKaren Campbell Photography\r\nWe harness the power of the tiny microbe, Zara Summers, Ph.D. explained, Theyre eating gas, theyre e… [+6899 chars]"
  },
  {
    "title": "Unpacking “God of the Gaps”",
    "description": "In science and faith discussions, the God-of-the-gaps fallacy is a kind of death sentence. It means you have violated a cardinal rule. What’s going on? What exactly is this fallacy, and why is it such a bad thing?",
    "publishedAt": "2025-06-30T11:00:00Z",
    "source": "Crossway.org",
    "url": "https://www.crossway.org/articles/unpacking-god-of-the-gaps/",
    "content": "This article is part of the Unpacking Culture series in which we examine a well-known axiom and weigh any true or positive aspects of it against any negative or misleading connotations of the phrase.… [+11483 chars]"
  },
  {
    "title": "Morning Bid: The euro's big beautiful moment",
    "description": "Investors are keeping a wary eye on the progress of President Donald Trump's \"One Big Beautiful\" U.S. tax-cutting and spending bill that is slowly making its...",
    "publishedAt": "2025-06-30T10:31:30Z",
    "source": "Yahoo Entertainment",
    "url": "https://finance.yahoo.com/news/morning-bid-euros-big-beautiful-103130389.html",
    "content": "By Mike Dolan\r\nLONDON (Reuters) -What matters in U.S. and global markets today\r\nInvestors are keeping a wary eye on the progress of President Donald Trump's \"One Big Beautiful\" U.S. tax-cutting and s… [+6258 chars]"
  },
  {
    "title": "Israeli strikes hit 4 school shelters in Gaza after hundreds of families ordered to evacuate",
    "description": "Palestinians in northern Gaza reported one of the worst nights of Israeli bombardment in weeks after the military issued mass evacuation orders on Monday. It comes as Israeli officials were due in Washington for a new ceasefire push by the Trump administratio…",
    "publishedAt": "2025-06-30T10:10:02Z",
    "source": "CBC News",
    "url": "https://www.cbc.ca/news/world/gaza-israel-evacuations-bombardment-white-house-1.7574042",
    "content": "Palestinians in northern Gaza reported one of the worst nights of Israeli bombardment in weeks after the military issued mass evacuation orders on Monday, while Israeli officials were due in Washingt… [+3490 chars]"
  },
  {
    "title": "The Met’s Renovated Michael C. Rockefeller Wing, Reviewed",
    "description": "Julian Lucas on Kulapat Yantrasast’s redesign of the Met’s galleries of colonial art, and on restitution efforts to get the museum to return bronzes looted from Benin.",
    "publishedAt": "2025-06-30T10:00:00Z",
    "source": "The New Yorker",
    "url": "https://www.newyorker.com/magazine/2025/07/07/the-mets-luminous-new-rockefeller-wing-still-casts-some-shadows",
    "content": "It may be the most impressive of the recently modernized colonial collections, far surpassing Berlins much criticized Humboldt Forum. One laudable shift is the variety of media exhibitednot just scul… [+8935 chars]"
  },
  {
    "title": "Uganda, UAE, and Pakistan Top Export Destinations for Kenyan Goods",
    "description": "Uganda, the United Arab Emirates (UAE), and Pakistan emerged as the major destinations for Kenya’s domestic exports in April 2025, according to a report by KNBS",
    "publishedAt": "2025-06-30T09:49:11Z",
    "source": "Thekenyatimes.com",
    "url": "https://thekenyatimes.com/business/uganda-uae-and-pakistan-top-export-destinations-for-kenyan-goods/",
    "content": "Uganda, the United Arab Emirates (UAE), and Pakistan emerged as the major destinations for Kenyas domestic exports in April 2025, according to a report by the Kenya National Bureau of Statistics (KNB… [+3398 chars]"
  },
  {
    "title": "Israel steps up Gaza bombardment ahead of White House talks on ceasefire",
    "description": "CAIRO: Palestinians in northern Gaza reported one of the worst nights of Israeli bombardment in weeks after the military issued mass evacuation orders on Monday (Jun 30), while Israeli officials were due in Washing",
    "publishedAt": "2025-06-30T09:48:03Z",
    "source": "CNA",
    "url": "https://www.channelnewsasia.com/world/israel-hamas-war-gaza-strikes-us-ceasefire-evacuations-5211376",
    "content": "A day after Trump called to \"Make the deal in Gaza, get the hostages back\", Israel's Strategic Affairs Minister Ron Dermer, a confidant of Netanyahu's, was expected on Monday at the White House for t… [+1476 chars]"
  },
  {
    "title": "After Iran, Trump Aims to End War in Gaza",
    "description": "After brokering a ceasefire between Israel and Iran, Trump is pushing for a deal to end the war in Gaza.",
    "publishedAt": "2025-06-30T09:30:00Z",
    "source": "Time",
    "url": "https://time.com/7298631/trump-israel-gaza-hamas-war-ceasefire-deal-palestinians-idf-netanyahu/",
    "content": "After brokering a fragile ceasefire between Israel and Iran, Donald Trump is urging Israel and Hamas to make a deal that would stop the 20-month-long war in Gaza that has killed more than 50,000 Pale… [+7251 chars]"
  },
  {
    "title": "Anwar making week-long official visit to Italy, France and Brazil",
    "description": "PUTRAJAYA: Prime Minister Datuk Seri Anwar Ibrahim will embark on a week-long tour from July 1 to 7 covering three major economic hubs, namely Italy, France and Brazil, to bolster economic, trade and strategic ties, says the Prime Minister's Office (PMO). Rea…",
    "publishedAt": "2025-06-30T09:04:00Z",
    "source": "The Star Online",
    "url": "https://www.thestar.com.my/news/nation/2025/06/30/anwar-making-week-long-official-visit-to-italy-france-and-brazil",
    "content": "PUTRAJAYA: Prime Minister Datuk Seri Anwar Ibrahim will embark on a week-long tour from July 1 to 7 covering three major economic hubs, namely Italy, France and Brazil, to bolster economic, trade and… [+2388 chars]"
  },
  {
    "title": "APA Corporation (NASDAQ:APA) Shares Acquired by Transcend Capital Advisors LLC",
    "description": "Transcend Capital Advisors LLC boosted its position in shares of APA Corporation (NASDAQ:APA – Free Report) by 73.6% in the 1st quarter, HoldingsChannel reports. The institutional investor owned 18,139 shares of the company’s stock after buying an additional …",
    "publishedAt": "2025-06-30T08:58:58Z",
    "source": "ETF Daily News",
    "url": "https://www.etfdailynews.com/2025/06/30/apa-corporation-nasdaqapa-shares-acquired-by-transcend-capital-advisors-llc/",
    "content": "Transcend Capital Advisors LLC boosted its position in shares of APA Corporation (NASDAQ:APA – Free Report) by 73.6% in the 1st quarter, HoldingsChannel reports. The institutional investor owned 18,1… [+4990 chars]"
  },
  {
    "title": "Israeli Gas Flows to Egypt Return to Normal as Iran Truce Holds",
    "description": "Daily exports have climbed to 1 billion cubic feet per day, according to two people with direct knowledge of the situation.",
    "publishedAt": "2025-06-30T06:43:37Z",
    "source": "Rigzone",
    "url": "https://www.rigzone.com/news/wire/israeli_gas_flows_to_egypt_return_to_normal_as_iran_truce_holds-30-jun-2025-180982-article/",
    "content": "Israeli natural gas flows to Egypt returned to normal levels after a truce with Iran allowed the Jewish state to reopen facilities shuttered by the 12-day conflict.\r\nDaily exports have climbed to 1 b… [+1118 chars]"
  },
  {
    "title": "Illegal immigration: With the “Evros recipe” in the Libyan Sea – The second smuggling route to Crete is being sealed",
    "description": "Caravans of 7,044 illegal immigrants since the beginning of the year, 95% are men aged 18-35, 98% are not entitled to asylum - Mitsotakis secured EU support like in Thrace in 2020\nThe post Illegal immigration: With the “Evros recipe” in the Libyan Sea – The s…",
    "publishedAt": "2025-06-30T06:00:41Z",
    "source": "Protothema.gr",
    "url": "https://en.protothema.gr/2025/06/30/illegal-immigration-with-the-evros-recipe-in-the-libyan-sea-the-second-smuggling-route-to-crete-is-being-sealed/",
    "content": "The government is adopting a hardline stance on illegal immigration using the “Evros formula,” in an effort to prevent the consolidation of a new route controlled by smuggling networks that targets C… [+9703 chars]"
  },
  {
    "title": "Israel’s offensive on Iran upgrades US economy and defense",
    "description": "Israel’s strategic posture vis a vis the US is that of the largest US aircraft carrier, which does not require a single American on board, cannot be sunk, and is deployed in a most critical area. And there is much more. Analysis.",
    "publishedAt": "2025-06-30T05:10:57Z",
    "source": "Israelnationalnews.com",
    "url": "https://www.israelnationalnews.com/news/410876",
    "content": "Ambassador (ret.) Yoram Ettingeris author of Second Thought: a US-Israel Initiativehttps://bit.ly/45HfzFo\r\n*The 12-day-offensive by Israels Air Force against the anti-US Ayatollah regime has reenforc… [+5039 chars]"
  },
  {
    "title": "Rita Ora says birthday party that breached lockdown rules changed her life",
    "description": "‘I just really was living every day like it was my last,’ singer said",
    "publishedAt": "2025-06-30T04:53:34Z",
    "source": "The-independent.com",
    "url": "https://www.the-independent.com/life-style/rita-ora-birthday-party-covid-lockdown-b2779305.html",
    "content": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+2858 chars]"
  },
  {
    "title": "The History of Saffron",
    "description": "Spanning cultures, continents, and civilizations, the history of saffron in human cultivation and use reaches back more than 3,000 years. Saffron, a spice derived from the stigmas of saffron crocus plants, has been used as a seasoning, fragrance, dye, and med…",
    "publishedAt": "2025-06-30T04:20:41Z",
    "source": "Thefreedictionary.com",
    "url": "https://encyclopedia.thefreedictionary.com/history+of+saffron",
    "content": "Human cultivation and use of saffron spans more than 3,500 years[1][2] and spans cultures, continents, and civilizations. Saffron, a spice derived from the dried stigmas of the saffron crocus (Crocus… [+27383 chars]"
  },
  {
    "title": "Chronological Reading for Monday June 30, 2025 (NIV)",
    "description": null,
    "publishedAt": "2025-06-30T04:06:17Z",
    "source": "Biblegateway.com",
    "url": "https://www.biblegateway.com/reading-plans/chronological/2025/06/30/",
    "content": "2 Chronicles 19-23\r\n\n\n 19 When Jehoshaphat king of Judah returned safely to his palace in Jerusalem, 2 Jehu(A) the seer, the son of Hanani, went out to meet him and said to the king, “Should you help… [+24601 chars]"
  },
  {
    "title": "Trump’s Path to World Peace: American Strength and Economic Partnership",
    "description": "Despite having overseen both the obliteration of Iran’s nuclear ambition and a cessation of hostilities in a war that had been raging between Isreal and Iran for nearly two weeks, President Trump is not being treated to any of the requisite acc...",
    "publishedAt": "2025-06-30T04:00:00Z",
    "source": "Americanthinker.com",
    "url": "https://www.americanthinker.com/articles/2025/06/trump_s_path_to_world_peace_american_strength_and_economic_partnership.html",
    "content": "Despite having overseen both the obliteration of Iran’s nuclear ambition and a cessation of hostilities in a war that had been raging between Isreal and Iran for nearly two weeks, President Trump is … [+7940 chars]"
  },
  {
    "title": "Dozens of MPs call on Starmer to 'urgently' establish Ukraine-style visa for Gazans",
    "description": "Dozens of MPs have called on Sir Keir Starmer to \"urgently\" establish a Ukraine-style visa to allow Gazans with family in the UK to come to Britain.",
    "publishedAt": "2025-06-30T04:00:00Z",
    "source": "Sky.com",
    "url": "https://news.sky.com/story/dozens-of-mps-call-on-starmer-to-urgently-establish-ukraine-style-visa-for-gazans-13390288",
    "content": "Dozens of MPs have called on Sir Keir Starmer to \"urgently\" establish a Ukraine-style visa to allow Gazans with family in the UK to come to Britain.\r\nIn a letter seen exclusively by Sky News, the 67 … [+5399 chars]"
  },
  {
    "title": "When the Crowds Go Home",
    "description": "Fifteen years after the mass protest decade began, the question remains: what happens when the crisis endures?",
    "publishedAt": "2025-06-30T01:33:12Z",
    "source": "Africasacountry.com",
    "url": "https://africasacountry.com/2025/06/when-the-crowds-go-home/",
    "content": "Fifteen years after the mass protest decade began, the question remains: what happens when the crisis endures?\n\n\n\n \n \n \n \r\n \n\n\n\n\n\n \n This newspaper—what we’re calling a “special issue”—is on the long… [+10432 chars]"
  },
  {
    "title": "Shilo Sanders' support helps transform Egyptian athlete's dreams at Colorado",
    "description": "Dreams can take you across continents, but they rarely come true without someone opening a door. \n\nFor Egyptian-born Yahya Attia, the leap from Austria to the United States and the",
    "publishedAt": "2025-06-30T01:02:51Z",
    "source": "Marca",
    "url": "https://www.marca.com/en/nfl/tampa-bay-buccaneers/2025/06/30/6861cb4f22601d7b588b45a2.html",
    "content": "Dreams can take you across continents, but they rarely come true without someone opening a door. \r\nShilo Sanders met a fan who loves Tampa's safety\r\nFor Egyptian-born Yahya Attia, the leap from Austr… [+3381 chars]"
  },
  {
    "title": "The Politics of the Football Terrace",
    "description": "In Algeria, football stadiums have long been sites of protest, expression, and resistance. As public space shrinks and surveillance rises, \r\ntheir political future hangs in the balance.",
    "publishedAt": "2025-06-30T00:52:02Z",
    "source": "Africasacountry.com",
    "url": "https://africasacountry.com/2025/06/the-politics-of-the-football-terrace/",
    "content": "In Algeria, football stadiums have long been sites of protest, expression, and resistance. As public space shrinks and surveillance rises, \r\ntheir political future hangs in the balance.\n\n\n\n \n \n Young… [+21248 chars]"
  },
  {
    "title": "Report: Egypt promoting 60-day ceasefire agreement in Gaza",
    "description": "Egyptian Foreign Minister Badr Abdelatty announces that Egypt is working to secure an agreement that includes a 60-day ceasefire in Gaza. He accuses Israel of violating the previous agreement and warns that renewed fighting would become a source of regional i…",
    "publishedAt": "2025-06-29T22:24:39Z",
    "source": "Israelnationalnews.com",
    "url": "https://www.israelnationalnews.com/news/410864",
    "content": "Egyptian Foreign Minister Badr Abdelatty announced on Sunday that Egypt is working to promote a ceasefire agreement in the Gaza Strip, proposing a 60-day truce as a step toward a final agreement to e… [+1173 chars]"
  },
  {
    "title": "Eleven killed in Sudan gold mine collapse as civil war rages",
    "description": "Seven workers were injured in the collapse, which occurred in an area controlled by the Sudanese Armed Forces.",
    "publishedAt": "2025-06-29T22:05:40Z",
    "source": "Al Jazeera English",
    "url": "https://www.aljazeera.com/news/2025/6/29/eleven-killed-in-sudan-gold-mine-collapse-as-civil-war-rages",
    "content": "The partial collapse of a traditional gold mine in Sudans northeast has killed 11 miners and wounded seven others, according to the state mining company, as a brutal civil war between the Sudanese Ar… [+2429 chars]"
  },
  {
    "title": "The Incredible Life And Tragic Death Of Baldwin IV, The ‘Leper King’ Of Jerusalem",
    "description": "While reigning over medieval Jerusalem from 1174 to 1185, King Baldwin IV made a name for himself as a talented leader and a brave soldier despite his leprosy.\nThe post The Incredible Life And Tragic Death Of Baldwin IV, The ‘Leper King’ Of Jerusalem appeared…",
    "publishedAt": "2025-06-29T22:00:00Z",
    "source": "Allthatsinteresting.com",
    "url": "https://allthatsinteresting.com/king-baldwin-iv",
    "content": "While reigning over medieval Jerusalem from 1174 to 1185, King Baldwin IV made a name for himself as a talented leader and a brave soldier despite his leprosy.\r\nWikimedia CommonsA 13th-century depict… [+6773 chars]"
  },
  {
    "title": "Demon Slayer Movie Drops First Look at Zenitsu’s Final Fight",
    "description": "ufotable\nDemon Slayer: Kimetsu no Yaiba is gearing up for its big return with a new film hitting theaters in Japan later this Summer, and the first trailer for Demon Slayer: Kimetsu no Yaiba Infinity Castle has given fans the first look at Zenitsu Agatsuma’s …",
    "publishedAt": "2025-06-29T20:49:10Z",
    "source": "ComicBook.com",
    "url": "http://comicbook.com/anime/news/demon-slayer-movie-zenitsu-infinity-castle-fight/",
    "content": "Demon Slayer: Kimetsu no Yaiba is gearing up for its big return with a new film hitting theaters in Japan later this Summer, and the first trailer for Demon Slayer: Kimetsu no Yaiba Infinity Castle h… [+3684 chars]"
  },
  {
    "title": "Zohran Mamdani repeatedly pressed on whether he condemns 'globalize the intifada' term in NBC interview",
    "description": "New York City mayoral candidate Zohran Mamdani was repeatedly pressed by NBC News host Kristen Welker on Sunday about why he doesn't want to condemn the phrase, \"globalize the intifada,\" insisting that he didn't want to \"police language.\" \"I want to ask you a…",
    "publishedAt": "2025-06-29T20:23:23Z",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-chat/4326000/posts",
    "content": "Skip to comments.\r\nZohran Mamdani repeatedly pressed on whether he condemns 'globalize the intifada' term in NBC interviewFox News ^\r\n | 6/29/25\r\n | Hanna Panreck\r\nPosted on 06/29/2025 1:23:23 PM PDT… [+7242 chars]"
  },
  {
    "title": "Israel begins new push in Gaza as Trump calls for hostage 'deal'",
    "description": "Local medics say at least 23 people were killed by Israeli air strikes and gunfire in the Palestinian enclave, as Arab states and the United States renew efforts to reach a ceasefire.",
    "publishedAt": "2025-06-29T19:35:32Z",
    "source": "ABC News (AU)",
    "url": "https://www.abc.net.au/news/2025-06-30/gaza-israel-trump-deal-hostages-gunfire/105475138",
    "content": "Israel's military has issued fresh evacuation notices for parts of Gaza, heralding a new operation in the Palestinian enclave against Hamas, as it carried out further strikes on Sunday.\r\nIt came as U… [+4601 chars]"
  },
  {
    "title": "The Strait of Hormuz – Incoming Global Energy Crisis?",
    "description": "Supply chain constraints are inevitable during wartime. Shippers are actively avoiding the Strait of Hormuz that connects the Persian Gulf to the Arabian Sea amid the Iranian nuclear tensions. This is a significant disruption as around 20% of global oil is fu…",
    "publishedAt": "2025-06-29T19:00:00Z",
    "source": "Activistpost.com",
    "url": "https://www.activistpost.com/the-strait-of-hormuz-incoming-global-energy-crisis/",
    "content": "Supply chain constraints are inevitable during wartime. Shippers are actively avoiding the Strait of Hormuz that connects the Persian Gulf to the Arabian Sea amid the Iranian nuclear tensions. This i… [+3145 chars]"
  },
  {
    "title": "Sudan: Workers killed in gold mine collapse",
    "description": "A state-owned mining company said it had warned against working the \"artisanal\" shaft in Sudan's northeast because of the \"risk to life.\" Gold-mining has helped fund the brutal civil war that broke out in 2023.",
    "publishedAt": "2025-06-29T18:52:00Z",
    "source": "DW (English)",
    "url": "https://www.dw.com/en/sudan-workers-killed-in-gold-mine-collapse/a-73086004",
    "content": "A least 11 miners were killed after a gold mine collapsed in Sudan, a state-owned mining company announced on Sunday.\r\nThe Sudanese Mineral Resources Company (SMRC) said the collapse occurred in an \"… [+1232 chars]"
  },
  {
    "title": "Sudan: Miners killed in gold mine collapse",
    "description": "A state-owned mining company said it had warned against working the artisanal shaft in Sudan's northeast due to \"risk to life.\" Gold mining has helped fund Sudan's brutal civil war that broke out in 2023. A least 11 miners were killed after a gold mine collap…",
    "publishedAt": "2025-06-29T18:52:00Z",
    "source": "DW (English)",
    "url": "https://www.dw.com/en/sudan-miners-killed-in-gold-mine-collapse/a-73086004",
    "content": "A least 11 miners were killed after a gold mine collapsed in Sudan, a state-owned mining company said on Sunday.\r\nThe Sudanese Mineral Resources Company (SMRC) said that the collapse occurred in an \"… [+1219 chars]"
  },
  {
    "title": "Israeli military orders mass evacuations in Northern Gaza",
    "description": "Israeli military directed Palestinians to leave northern Gaza due to increased combat against Hamas. Donald Trump urged a Gaza deal for hostage release. Benjamin Netanyahu planned talks on the offensive's progress. The military escalated operations in Jabalia…",
    "publishedAt": "2025-06-29T18:42:41Z",
    "source": "The Times of India",
    "url": "https://economictimes.indiatimes.com/news/international/world-news/israeli-military-orders-mass-evacuations-in-northern-gaza/articleshow/122146601.cms",
    "content": "The Israeli military ordered Palestinians to evacuate areas in northern Gaza on Sunday before intensified fighting against Hamas, as US President Donald Trump called for an end to the war amid renewe… [+2750 chars]"
  },
  {
    "title": "Rod Stewart at Glastonbury: Old school charm from another era",
    "description": "The star brings out several special guests and seranades Michael Eavis in a Vegas-style set.",
    "publishedAt": "2025-06-29T17:55:04Z",
    "source": "BBC News",
    "url": "https://www.bbc.com/news/articles/cd0vlymky4ko",
    "content": "Mark SavageReporting from\r\nGlastonbury Festival\r\nRod Stewart is the first artist to have both headlined the Pyramid Stage and played the legend slot\r\nAt the age of 80, Rod Stewart has earned the righ… [+4870 chars]"
  },
  {
    "title": "16 Newly Released Wildlife ImagesWinners Of BigPicture Photo Competition",
    "description": "The photo of a courageous mother lemur with a baby on her back, taking a harrowing jump in a ravine, won the California Academy of Science's BigPicture Photography contest.",
    "publishedAt": "2025-06-29T16:16:31Z",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/ceciliarodriguez/2025/06/29/16-newly-released-wildlife-imageswinners-of-bigpicture-photo-competition/",
    "content": "Puddle Jumper, Aquatic Life Finalist. Mudskippers wrench themselves across mudflats, over rocks and ... More even up the trunks of mangrove trees; Goode Beach, Australia\r\nGeorgina Steytler, Australia… [+18776 chars]"
  },
  {
    "title": "Earliest boomerang was made in Poland, and it's 40,000 years old",
    "description": "The boomerang-shaped artifact made of mammoth tusk had been found in 1987 and misdated to a mere 20,000 years, but it's Aurignacian and likely served a ritual function, archaeologists say",
    "publishedAt": "2025-06-29T14:43:42Z",
    "source": "Haaretz",
    "url": "https://www.haaretz.com/archaeology/2025-06-29/ty-article/earliest-boomerang-was-made-in-poland-and-its-40-000-years-old/00000197-bbf6-dd94-addf-bbf7d7420000",
    "content": "In southern Poland near the border with Slovakia is a cave that was home for hundreds of thousands of years, first for Neanderthals and later for modern humans. Obazowa Cave has been undergoing excav… [+9674 chars]"
  },
  {
    "title": "How to watch Wimbledon 2025 online: live stream tennis, order or play, TV schedule",
    "description": "All the ways to watch Wimbledon live streams online and from anywhere – including for FREE – as Carlos Alcaraz and Barbora Krejčíková defend their titles.",
    "publishedAt": "2025-06-29T14:08:42Z",
    "source": "TechRadar",
    "url": "https://www.techradar.com/streaming/entertainment/watch-wimbledon-2025-online-live-stream-tennis-free",
    "content": "This year's Wimbledon live streams see Carlos Alcaraz going for three-in-a-row and the likes of Aryna Sabalenka and Coco Gauff attempting to prevent yet another surprise champion in the women's singl… [+11872 chars]"
  },
  {
    "title": "Monday Morning Update 6/30/25",
    "description": "Top News CMS announces a six-year pilot in six states ...",
    "publishedAt": "2025-06-29T14:02:59Z",
    "source": "Histalk2.com",
    "url": "https://histalk2.com/2025/06/29/monday-morning-update-6-30-25/",
    "content": "Top News\r\nCMS announces a six-year pilot in six states to test tech-enabled prior authorization for traditional Medicare, which has traditionally avoided prior authorizations. \r\nParticipating organiz… [+5611 chars]"
  },
  {
    "title": "Here’s Proof that Israel Lost the War: “Sizable portion of Military, Intelligence, Energy, and R&D facilities Destroyed”. Mike Whitney",
    "description": "The American people are not being told why Israel agreed to a ceasefire with Iran. The real reason they wanted a ceasefire was because they were getting systematically pulverized and needed to stop the bleeding fast.\nThe post Here’s Proof that Israel Lost the…",
    "publishedAt": "2025-06-29T14:00:50Z",
    "source": "Globalresearch.ca",
    "url": "https://www.globalresearch.ca/heres-proof-that-israel-lost-the-war-iran-destroyed-a-sizable-portion-of-israels-military-intelligence-industrial-energy-and-rd-facilities-mike-whitney/5893172",
    "content": "The American people are not being told why Israel agreed to a ceasefire with Iran. Yes, Israel was rapidly running out of air-defense interceptors (making it more vulnerable to Iranian attacks.) But … [+14145 chars]"
  },
  {
    "title": "Foreign Traveler Immediately Kicked Out of America After Abusing US Customs and Border Protection Beagle",
    "description": "Kicking a Customs and Border Protection dog is a good way to get yourself kicked out of the country — at least with President Donald Trump in the White House. An Egyptian traveler learned that lesson the hard way this week after a CBP beagle alerted his handl…",
    "publishedAt": "2025-06-29T12:58:55Z",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-news/4325920/posts",
    "content": "Skip to comments.\r\nForeign Traveler Immediately Kicked Out of America After Abusing US Customs and Border Protection BeagleWestern Journal ^\r\n | June 28, 2025\r\n | Joe Saunders\r\nPosted on 06/29/2025 5… [+5041 chars]"
  },
  {
    "title": "This Colorful Multi-Sensory Installation Invites You To Imagine a Better Future",
    "description": "This Colorful Multi-Sensory Installation Invites You To Imagine a Better Future\nLondon-based artist Pierre-Christophe Gam is the founder of Toguna World, a digital lab and creative think tank where art and technology converge to imagine new futures. Drawing o…",
    "publishedAt": "2025-06-29T12:50:59Z",
    "source": "My Modern Met",
    "url": "https://mymodernmet.com/the-sanctuary-of-dreams-pierre-christophe-gam/",
    "content": "London-based artist Pierre-Christophe Gam is the founder of Toguna World, a digital lab and creative think tank where art and technology converge to imagine new futures. Drawing on his rich cultural … [+2358 chars]"
  },
  {
    "title": "Israel tells people in northern Gaza to evacuate as Trump issues call for war to end",
    "description": "The Israeli military ordered Palestinians to evacuate areas in northern Gaza on Sunday before intensified fighting against Hamas, as U.S. President Donald Trump called for an end to the war amid renewed efforts to broker a ceasefire.",
    "publishedAt": "2025-06-29T12:47:12Z",
    "source": "CBC News",
    "url": "https://www.cbc.ca/news/world/israel-army-evacuations-north-gaza-trump-1.7573777",
    "content": "The Israeli military ordered Palestinians to evacuate areas in northern Gaza on Sunday ahead of intensified fighting against Hamas, as U.S. President Donald Trump called for an end to the war amid re… [+3800 chars]"
  },
  {
    "title": "Integrity Draws Men to God - Evangelical Caucus/Devotional",
    "description": "“Then Darius the king wrote to all the peoples, nations, and men of every language who were living in all the land: ‘May your peace abound! I make a decree that in all the dominion of my kingdom men are to fear and tremble before the God of Daniel; for He is …",
    "publishedAt": "2025-06-29T11:59:19Z",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-religion/4325910/posts",
    "content": "Skip to comments.\r\nIntegrity Draws Men to God - Evangelical Caucus/DevotionalGracetoyou.org ^\r\n | 2008\r\n | John McArthur, Grace Community Church\r\nPosted on 06/29/2025 4:59:19 AM PDT by metmom\r\nThen D… [+2982 chars]"
  },
  {
    "title": "Top 5 Essential Toolbox Innovations for Modern DIY and Home Improvement in 2025",
    "description": "Top 5 Essential Toolbox Innovations for Modern DIY and Home Improvement in 2025In today’s fast-paced world, where DIY projects, quick fixes, and home improvement tasks are part of everyday life, the toolbox has become an indispensable companion...",
    "publishedAt": "2025-06-29T11:40:44Z",
    "source": "Yanko Design",
    "url": "https://www.yankodesign.com/2025/06/29/top-5-essential-toolbox-innovations-for-modern-diy-and-home-improvement-in-2025/",
    "content": "In todays fast-paced world, where DIY projects, quick fixes, and home improvement tasks are part of everyday life, the toolbox has become an indispensable companion in nearly every home. Although sma… [+8339 chars]"
  },
  {
    "title": "\"Tiny Nation\": David H Green’s new song echoes Jewish resilience",
    "description": "Singer-songwriter David H Green has released a stirring new single titled “Tiny Nation”, a powerful musical reflection on the survival of the Jewish people against the odds.",
    "publishedAt": "2025-06-29T11:35:41Z",
    "source": "Israelnationalnews.com",
    "url": "https://www.israelnationalnews.com/news/410832",
    "content": "Singer-songwriter David H Green has released a stirring new single titled Tiny Nation, a powerful musical reflection on the survival of the Jewish people against the odds.\r\nThe song chronicles a long… [+1461 chars]"
  },
  {
    "title": "HGTV's 'Married to Real Estate' Canceled in Shocking Announcement",
    "description": "\"Married to Real Estate\" star Egypt Sherrod shares devastating news about the future of her and her husband's HGTV show that shocked fans.",
    "publishedAt": "2025-06-29T11:03:15Z",
    "source": "countryliving.com",
    "url": "https://www.countryliving.com/life/entertainment/a65192632/hgtv-married-to-real-estate-cancelled/",
    "content": "Well, we hate to be the bearer of bad news, but HGTV fans need to be made aware of this shocking new development. \r\nIn a surprising turn of events, HGTV has decided not to renew the hit series Marrie… [+2750 chars]"
  },
  {
    "title": "I'm a Christian pastor who was born in Egypt. Here are 3 facts I learned about Iran's nuclear obsession",
    "description": "Iran's nuclear obsession can be explained through three key facts: deterrence failure, religious incentives for apocalyptic conflict and threats to Western civilization beyond Israel.",
    "publishedAt": "2025-06-29T11:00:36Z",
    "source": "Fox News",
    "url": "https://www.foxnews.com/opinion/im-christian-pastor-who-born-egypt-here-3-facts-i-learned-about-irans-nuclear-obsession",
    "content": "I grew up in a Christian community in Egypt. Like many other families, we suffered firsthand under the oppressive rule of the Islamo-socialist regime of Gamal Abdel Nasser, chairman of the Revolution… [+5814 chars]"
  },
  {
    "title": "Rita Ora says birthday party that breached lockdown rules changed her life",
    "description": "‘I just really was living every day like it was my last,’ singer said",
    "publishedAt": "2025-06-29T10:47:57Z",
    "source": "The-independent.com",
    "url": "https://www.the-independent.com/life-style/rita-ora-party-lockdown-coronavirus-b2779028.html",
    "content": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+2858 chars]"
  },
  {
    "title": "Shoes in Sepia Tone. Sunday Morning Photograph.",
    "description": "To test out the new camera that I recently purchased, I took a photograph of shoes; and then I adjusted the photograph to show the shoes in sepia tone to give it more of an antique look.\nGetting...\nThe post Shoes in Sepia Tone. Sunday Morning Photograph. appe…",
    "publishedAt": "2025-06-29T10:03:59Z",
    "source": "Thegatewithbriancohen.com",
    "url": "https://thegatewithbriancohen.com/shoes-in-sepia-tone-sunday-morning-photograph/",
    "content": "To test out the new camera that I recently purchased, I took a photograph of shoes; and then I adjusted the photograph to show the shoes in sepia tone to give it more of an antique look.\r\nShoes in Se… [+1901 chars]"
  },
  {
    "title": "Somerset couple chase bucket list dreams amid health scares",
    "description": "The couple have visited 50 countries after overcoming a cardiac arrest and cancer diagnosis.",
    "publishedAt": "2025-06-29T09:47:17Z",
    "source": "BBC News",
    "url": "https://www.bbc.co.uk/news/articles/c939qy44r61o",
    "content": "\"We gained quite a good following off the back of that trip,\" the couple said.\r\n\"People were asking us how we do it, saying we were quite inspirational, which made us blush a lot. \r\n\"We started blogg… [+227 chars]"
  },
  {
    "title": "Israeli Gas Flows to Egypt Return to Normal as Iran Truce Holds",
    "description": "",
    "publishedAt": "2025-06-29T09:00:11Z",
    "source": "Biztoc.com",
    "url": "https://biztoc.com/x/799becd6b8e278e1",
    "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;Why did the S&amp;P 500 hit a new record high? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will Trumps big, beaut… [+807 chars]"
  },
  {
    "title": "Israel orders evacuations in northern Gaza as Trump calls for war to end",
    "description": "\"Make the deal in Gaza, get the hostages back,\" Trump posted on his Truth Social platform early on Sunday.",
    "publishedAt": "2025-06-29T08:54:44Z",
    "source": "New York Post",
    "url": "https://nypost.com/2025/06/29/world-news/israel-orders-northern-gaza-evacuations-as-trump-calls-for-hamas-war-to-end/",
    "content": "The Israeli military ordered Palestinians to evacuate areas in northern Gaza on Sunday before intensified fighting against Hamas, as US President Donald Trump called for an end to the war amid renewe… [+3408 chars]"
  },
  {
    "title": "Hong Kong Palace Museum to exhibit Egyptian relics in landmark cultural collaboration",
    "description": "The Hong Kong Palace Museum will host the city’s largest-ever exhibition of Egyptian antiquities beginning November 20. Featuring 250 relics, including feline mummies and a statue of Tutankhamen, the exhibition marks a broader cultural partnership between Egy…",
    "publishedAt": "2025-06-29T07:27:30Z",
    "source": "The Times of India",
    "url": "https://economictimes.indiatimes.com/news/international/hong-kong/hong-kong-palace-museum-to-exhibit-egyptian-relics-in-landmark-cultural-collaboration/articleshow/122139724.cms",
    "content": "Hong Kong Palace Museum and Egypt launch major antiquities exhibitionThe Hong Kong Palace Museum and Egypts Supreme Council of Antiquities have formalized a new cultural partnership with the launch o… [+2460 chars]"
  },
  {
    "title": "Gaza civil defense says Israeli forces kill 37, including children",
    "description": "Gaza's civil defense agency said Israeli forces killed 37 people in the devastated territory on Saturday, including at least nine children who died in strikes.",
    "publishedAt": "2025-06-29T06:34:25Z",
    "source": "Hurriyet Daily News",
    "url": "https://www.hurriyetdailynews.com/gaza-civil-defense-says-israeli-forces-kill-37-including-children-210863",
    "content": "GAZA CITY\r\nGaza's civil defense agency said Israeli forces killed 37 people in the devastated territory on Saturday, including at least nine children who died in strikes.\r\nCivil defense spokesman Mah… [+2799 chars]"
  },
  {
    "title": "UK Considers Envoy For Britons Held Abroad",
    "description": "Britain is preparing to emulate the United States by appointing an envoy tasked with freeing citizens arbitrarily detained abroad, as it faces calls to do more to bring them home.",
    "publishedAt": "2025-06-29T05:27:19Z",
    "source": "Ibtimes.com.au",
    "url": "https://www.ibtimes.com.au/uk-considers-envoy-britons-held-abroad-1859449",
    "content": "Britain is preparing to emulate the United States by appointing an envoy tasked with freeing citizens arbitrarily detained abroad, as it faces calls to do more to bring them home.\r\nHigh-profile cases… [+4235 chars]"
  },
  {
    "title": "UK Considers Envoy For Britons Held Abroad",
    "description": "Britain is preparing to emulate the United States by appointing an envoy tasked with freeing citizens arbitrarily detained abroad, as it faces calls to do more to bring them home.",
    "publishedAt": "2025-06-29T05:27:15Z",
    "source": "International Business Times",
    "url": "https://www.ibtimes.com/uk-considers-envoy-britons-held-abroad-3777166",
    "content": "Britain is preparing to emulate the United States by appointing an envoy tasked with freeing citizens arbitrarily detained abroad, as it faces calls to do more to bring them home.\r\nHigh-profile cases… [+4235 chars]"
  },
  {
    "title": "The origins of Israel’s conflicts with Iran, Hamas and Hizbullah",
    "description": "Almost eight decades of Arab-Israeli conflict explained",
    "publishedAt": "2025-06-29T05:00:00Z",
    "source": "The Irish Times",
    "url": "https://www.irishtimes.com/world/middle-east/2025/06/29/the-origins-of-israels-conflicts-with-iran-hamas-and-hizbullah/",
    "content": "1948: The State of Israel is declared. British troops leave and fighting breaks out with Arab neighbours. Some 700,000 Palestinians, half the Arab population of British-ruled Palestine, flee or are d… [+4866 chars]"
  },
  {
    "title": "‘A Very Consequential Two Weeks’",
    "description": "That’s Selena Zito’s take, and I fully agree with her.  \r\n\r\n\r\nThere is an old wisdom in political science that real presidential power, whether domestic or international, is the power of persuasion. In less than two weeks, Trump...",
    "publishedAt": "2025-06-29T04:00:00Z",
    "source": "Americanthinker.com",
    "url": "https://www.americanthinker.com/articles/2025/06/a_very_consequential_two_weeks.html",
    "content": "That’s Selena Zito’s take, and I fully agree with her.  \r\nThere is an old wisdom in political science that real presidential power, whether domestic or international, is the power of persuasion. In l… [+12290 chars]"
  }
]