[
  {
    "title": "Gaza war must continue – Israeli minister",
    "description": "Israeli Finance Minister Bezalel Smotrich has vowed to oppose any ceasefire deal and is pushing for a “decisive” victory against Hamas Read Full Article at RT.com",
    "publishedAt": "2025-07-01T21:02:06Z",
    "source": "RT",
    "url": "https://www.rt.com/news/620856-gaza-war-israel-hamas/",
    "content": "Israeli Finance Minister Bezalel Smotrich has said that the war in Gaza must continue until “a decisive victory” is achieved, rejecting calls for a ceasefire or negotiated settlement.\r\nSpeaking at a … [+2027 chars]"
  },
  {
    "title": "Joseph's Well Releases 2025 Update on Faith-Based Water Security Innovation Amid Rising Drought and Global Instability",
    "description": "In this 2025 preparedness update, Joseph's Well shares timely insights on atmospheric water generation technology designed for off-grid use. With intensifying megadrought forecasts and increasing global uncertainty, the announcement highlights how a biblical …",
    "publishedAt": "2025-07-01T20:28:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108802/0/en/Joseph-s-Well-Releases-2025-Update-on-Faith-Based-Water-Security-Innovation-Amid-Rising-Drought-and-Global-Instability.html",
    "content": "PHOENIX, July 01, 2025 (GLOBE NEWSWIRE) -- \r\nSection 1 Introduction\r\nAcross the United States, signs of a growing water crisis are becoming impossible to ignore. From drying reservoirs and collapsing… [+17910 chars]"
  },
  {
    "title": "Katarzyna Sidło on EU-Egypt Relations",
    "description": "Katarzyna Sidło on EU-Egypt Relations\nfanny.pollet@i…\nTue, 07/01/2025 - 23:05\n\n\n Katarzyna Sidło was quoted in an article by the Luxembourg Times examining the EU’s strategic engagement with Egypt amid growing geopolitical and economic instability.\r\n\nIn the p…",
    "publishedAt": "2025-07-01T20:05:12Z",
    "source": "Europa.eu",
    "url": "https://www.iss.europa.eu/press/katarzyna-sidlo-eu-egypt-relations",
    "content": "Katarzyna Sido was quoted in an article by the Luxembourg Times examining the EUs strategic engagement with Egypt amid growing geopolitical and economic instability.\r\nIn the piece, Dr Sido commented … [+708 chars]"
  },
  {
    "title": "Archaeologists make 90 metre long Ancient Roman discovery buried on the ocean floor",
    "description": "Divers excavated something in Italy that could reveal Roman-era secrets",
    "publishedAt": "2025-07-01T20:04:26Z",
    "source": "LADbible",
    "url": "https://www.ladbible.com/news/world-news/archaeologists-ancient-rome-breakwater-italy-810912-20250701",
    "content": "Ancient history is something everyone is interested in and when an archaeological find is discovered, it really does mean so much to understanding more about our ancestors.\r\nTheres nothing quite like… [+3157 chars]"
  },
  {
    "title": "Rumor: Is Lucasfilm quietly planning an Indiana Jones reboot?",
    "description": "A new rumor suggests that Lucasfilm and Disney will announce an Indiana Jones reboot at next year's D23 Expo.\nThe post Rumor: Is Lucasfilm quietly planning an Indiana Jones reboot? appeared first on JoBlo.",
    "publishedAt": "2025-07-01T19:39:52Z",
    "source": "JoBlo.com",
    "url": "https://www.joblo.com/indiana-jones-reboot-lucasfilm/",
    "content": "If you thought Disney was calling it quits after disappointing box office returns for Indiana Jones and the Dial of Destiny, think again! According to The DisInsider, the same site that scooped Pixar… [+1922 chars]"
  },
  {
    "title": "Marcella Hazan biography and career timeline",
    "description": "Marcella Hazan lived an improbably eventful life. An immigrant woman trained as a scientist, she never set foot in a kitchen until she married and moved to America in the 1950s. A childhood injury had left her with an injured right arm, a challenge for the ph…",
    "publishedAt": "2025-07-01T19:39:03Z",
    "source": "PBS",
    "url": "https://www.pbs.org/wnet/americanmasters/marcella-hazan-biography-and-career-timeline/36253/",
    "content": "Marcella Hazan lived an improbably eventful life. An immigrant woman trained as a scientist, she never set foot in a kitchen until she married and moved to America in the 1950s. A childhood injury ha… [+5541 chars]"
  },
  {
    "title": "Qatar presents Israel, Hamas with modified Witkoff hostage deal proposal, aims to reach ceasefire",
    "description": "If a temporary ceasefire is achieved, a US plan for \"the day after\" could serve as the basis for negotiations between Israel and Hamas to end the war. Qatar ...",
    "publishedAt": "2025-07-01T19:29:13Z",
    "source": "Yahoo Entertainment",
    "url": "https://www.yahoo.com/news/qatar-presents-israel-hamas-modified-192913693.html",
    "content": "If a temporary ceasefire is achieved, a US plan for \"the day after\" could serve as the basis for negotiations between Israel and Hamas to end the war.\r\nQatar has submitted a mediation proposal to bot… [+4387 chars]"
  },
  {
    "title": "A Blockbuster Exhibition in London Charts the Artistic Evolution of Cartier",
    "description": "With a blend of opulence and intellectual inquiry, the show balances spectacle with historical and artistic depth.",
    "publishedAt": "2025-07-01T19:26:54Z",
    "source": "Observer",
    "url": "https://observer.com/2025/07/jewelry-exhibition-review-cartier-v-and-a-museum-london/",
    "content": "Mountbatten Bandeau in Tutti Frutti style, English Art Works for Cartier London, 1928; Emeralds, rubies, sapphires, diamonds and platinum. © Victoria and Albert Museum, London\r\nA decade in the making… [+5474 chars]"
  },
  {
    "title": "'This won't be the end of the animosity': The story of 13 US presidents and Iran",
    "description": "As the world waits to see if Donald Trump's talks will go ahead, look back at how previous US presidents have handled Iran.",
    "publishedAt": "2025-07-01T18:37:05Z",
    "source": "ABC News (AU)",
    "url": "https://www.abc.net.au/news/2025-07-02/iran-us-relationship-history/105457754",
    "content": "The United States and Iran, over the past seven decades, have been friends, foes, and sometimes even frenemies.\r\nTheir history involves threats of regime change, proxy warfare, secret arms deals, und… [+27231 chars]"
  },
  {
    "title": "Holy Relics, Holy Places, Wholly Fiction",
    "description": "Discover why the Nazis' obsession with holy relics was based on complete fiction. From the Spear of Destiny to the Holy Grail, this exposé reveals how these legendary artifacts have zero historical basis—and why believers ignore the evidence.",
    "publishedAt": "2025-07-01T18:31:58Z",
    "source": "Skeptic.com",
    "url": "https://www.skeptic.com/article/holy-relics-holy-places-wholly-fiction/",
    "content": "I recently watched a television show alleging the fascination Hitler, Himmler, and the Nazis had for certain holy relics and their desire to possess them. Among these were the Ark of the Covenant, co… [+27904 chars]"
  },
  {
    "title": "Carotenoids Market: Rising Demand for Natural Ingredients and Wellness Products Fuels Global Growth",
    "description": "\" Comprehensive Analysis of Market Dynamics, Emerging Technologies, and Clean-Label Trends Shaping the Future of the Global Carotenoids Industry\" \" Comprehensive Analysis of Market Dynamics, Emerging Technologies, and Clean-Label Trends Shaping the Future of …",
    "publishedAt": "2025-07-01T18:26:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108727/0/en/Carotenoids-Market-Rising-Demand-for-Natural-Ingredients-and-Wellness-Products-Fuels-Global-Growth.html",
    "content": "Boston, July 01, 2025 (GLOBE NEWSWIRE) -- According to the latest study from BCC Research, The Global Market for Carotenoids is expected to grow from $2.1 billion in 2024 to $2.9 billion by the end o… [+6054 chars]"
  },
  {
    "title": "What's Coming To Disney+ In July 2025? Miley Cyrus & More",
    "description": "This July, Disney+ is premiering a can't-miss list of movies, specials, and shows, including Miley Cyrus' new visual album.",
    "publishedAt": "2025-07-01T17:44:38Z",
    "source": "Elite Daily",
    "url": "https://www.elitedaily.com/entertainment/whats-coming-disneyplus-july-2025-miley-cyrus",
    "content": "Miley Cyrus is revisiting her Disney beginnings, but that blonde Hannah Montana wig has been replaced with a pearlescent headpiece. A month and a half after she released her ninth studio record, Some… [+2601 chars]"
  },
  {
    "title": "Christians Among Most Likely to Ditch Their Religion",
    "description": "New analysis shows that have one of the lowest global retention rates compared to other major religions.",
    "publishedAt": "2025-07-01T17:32:37Z",
    "source": "Newsweek",
    "url": "https://www.newsweek.com/christianity-religion-research-study-analysis-2093185",
    "content": "Christians, the world's largest religious group, have one of the lowest global retention rates among major religions, a new report has found.\r\nA Pew Research Center report published last Thursday fou… [+4368 chars]"
  },
  {
    "title": "Sudanese fleeing war are at risk of worsening hunger in neighbouring nations, UN warns",
    "description": "The UN warns that millions of Sudanese refugees face worsening hunger in neighboring countries already struggling with food insecurity. With critical funding dwindling, over four million refugees in countries like Chad and Egypt are at risk. Sudan's conflict …",
    "publishedAt": "2025-07-01T17:26:35Z",
    "source": "The Times of India",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/sudanese-fleeing-war-are-at-risk-of-worsening-hunger-in-neighbouring-nations-un-warns/articleshow/122188817.cms",
    "content": "Virat Kohli and Anushka Sharma's spiritual journey: How they embraced mindfulness, devotion, and growth"
  },
  {
    "title": "Submerged Blocks of Alexandria's Ancient Lighthouse Lifted from Seafloor",
    "description": "ALEXANDRIA, EGYPT—Built in the third century b.c., the Lighthouse of Alexandria was one of the […]\nThe post Submerged Blocks of Alexandria's Ancient Lighthouse Lifted from Seafloor appeared first on Archaeology Magazine.",
    "publishedAt": "2025-07-01T17:00:00Z",
    "source": "Archaeology",
    "url": "https://archaeology.org/news/2025/07/01/submerged-blocks-of-alexandrias-ancient-lighthouse-lifted-from-seafloor/",
    "content": "Stone blocks from the lighthouse, Alexandria, Egypt\r\nALEXANDRIA, EGYPTBuilt in the third century b.c., the Lighthouse of Alexandria was one of the Seven Wonders of the Ancient World. Reaching a heigh… [+1096 chars]"
  },
  {
    "title": "Ammonia Market Size Volume to Reach 190.20 Million Tons By 2034",
    "description": "According to Towards Chem and Materials consultants, the global Ammonia market Volume demand stood is expected to reach 153.70 million tons in 2025 to 190.20 million tons by 2034 and continue to grow at a remarkable CAGR of 2.40 % during the forecast period u…",
    "publishedAt": "2025-07-01T16:20:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108659/0/en/Ammonia-Market-Size-Volume-to-Reach-190-20-Million-Tons-By-2034.html",
    "content": "Ottawa, July 01, 2025 (GLOBE NEWSWIRE) -- The Ammonia market Volume\r\n is predicted to grow from 150.10 million tons in 2024 to 190.20 million tons by 2034, driven by a CAGR of 2.40% A study published… [+28128 chars]"
  },
  {
    "title": "Multipolar World Getting Stronger with BRICS?",
    "description": "The BRICS group—Brazil, Russia, India, China, and South Africa—has uniquely emerged as a geopolitical player. Since its establishment, it has transformed into an informal association, struggling to re-shape the global architecture. Noticeably the world is rap…",
    "publishedAt": "2025-07-01T16:05:30Z",
    "source": "Globalresearch.ca",
    "url": "https://www.globalresearch.ca/multipolar-world-getting-stronger-brics/5893433",
    "content": "The BRICS groupBrazil, Russia, India, China, and South Africahas uniquely emerged as a geopolitical player. Since its establishment, it has transformed into an informal association, struggling to re-… [+12920 chars]"
  },
  {
    "title": "By sacrificing Palestine, Europe betrays itself",
    "description": "By refusing to take action on Israel, EU states are violating European and international law.",
    "publishedAt": "2025-07-01T16:03:57Z",
    "source": "Al Jazeera English",
    "url": "https://www.aljazeera.com/opinions/2025/7/1/by-sacrificing-palestine-europe-betrays-itself",
    "content": "Law is interpreted for friends and applied to enemies, Italian statesman Giovanni Giolitti once said.\r\nThere are few better examples of this than the way the European Union bends over backwards to av… [+8296 chars]"
  },
  {
    "title": "Tech Support - Paleontologist Answers Fossil Questions",
    "description": "Paleontologist and Geologist Dr. Ken Lacovara joins WIRED to answer the internet's burning questions about fossils. Can we extract dinosaur DNA from fossils? How is crude oil made from fossils? Where are the most common places to find fossils worldwide? How c…",
    "publishedAt": "2025-07-01T16:00:00Z",
    "source": "Wired",
    "url": "https://www.wired.com/video/watch/tech-support-paleontologist-answers-fossil-questions/",
    "content": "I'm Dr. Kenneth Lacovara,\r\npaleontologist and executive director\r\nof the Edelman Fossil Park of Rowan University.\r\nAnd I'm here to answer your questions from the internet.\r\nThis is fossil support.\r\n[… [+29296 chars]"
  },
  {
    "title": "North America and Global Gaming Business Directory 2025 | Access Contact Info for 20,000 North American Gaming Executives and Profiles of 9,600 Gaming Properties Worldwide",
    "description": "Dublin, July  01, 2025  (GLOBE NEWSWIRE) -- The \"Gaming Business Directory 2025 Edition\" book has been added to  ResearchAndMarkets.com's offering.  ...",
    "publishedAt": "2025-07-01T15:10:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108603/28124/en/North-America-and-Global-Gaming-Business-Directory-2025-Access-Contact-Info-for-20-000-North-American-Gaming-Executives-and-Profiles-of-9-600-Gaming-Properties-Worldwide.html",
    "content": "Dublin, July 01, 2025 (GLOBE NEWSWIRE) -- The \"Gaming Business Directory 2025 Edition\" book has been added to ResearchAndMarkets.com's offering.\r\nThe Gaming Business Directory provides information on… [+7279 chars]"
  },
  {
    "title": "7 Dreamworks Movies Perfect For a Live-Action Remake After How to Train Your Dragon",
    "description": "The live-action remake of How to Train Your Dragon has become a quick success story for Dreamworks Animation, so other movies could soon get this treatment, too. 2010’s original How to Train Your Dragon received acclaim thanks to its animation, writing, and p…",
    "publishedAt": "2025-07-01T15:08:00Z",
    "source": "ComicBook.com",
    "url": "http://comicbook.com/movies/news/dreamworks-movies-perfect-live-action-remake-httyd/",
    "content": "The live-action remake of How to Train Your Dragon has become a quick success story for Dreamworks Animation, so other movies could soon get this treatment, too. 2010’s original How to Train Your Dra… [+5103 chars]"
  },
  {
    "title": "Book Review: Shadi Hamid’s Excellent ‘The Problem Of Democracy’",
    "description": "A book that will make you think a great deal, regardless of whether or not you agree.",
    "publishedAt": "2025-07-01T15:00:00Z",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/johntamny/2025/07/01/book-review-shadi-hamids-excellent-the-problem-of-democracy/",
    "content": "WASHINGTON, USA - AUGUST 17: (L-R) Professor Halil Berktay, Burhanettin Duran, Kilic Kanat, Shadi ... More Hamid, and Kadir Ustun attend in a panel called \"The July 15 Failed Coup Attempt: Implicatio… [+27178 chars]"
  },
  {
    "title": "Why Southeast Asia Is Flocking to BRICS",
    "description": "The expanding bloc has become a hedge against future geopolitical shifts.",
    "publishedAt": "2025-07-01T14:38:16Z",
    "source": "Foreign Policy",
    "url": "http://foreignpolicy.com/2025/07/01/brics-summit-southeast-asia-asean-indonesia-china-geopolitics/",
    "content": "At the BRICS summit in Rio de Janeiro, Brazil, on July 6 and 7, the groups leaders will celebrate a significant expansion of their organization. Since 2024, the core BRICS states (Brazil, Russia, Ind… [+7896 chars]"
  },
  {
    "title": "A Lesson From Rome: You Cannot Welcome Armed, Unassimilated Enemies and Expect to Survive",
    "description": "In the Louvre there’s a famous painting by the French Artist Jacques-Louis David depicting the Intervention of the Sabine Women. In it the Sabine men, whose daughters were stolen by and then married to Romans in the mid-8th century BC, returned to avenge Roma…",
    "publishedAt": "2025-07-01T14:13:04Z",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-bloggers/4326280/posts",
    "content": "Skip to comments.\r\nA Lesson From Rome: You Cannot Welcome Armed, Unassimilated Enemies and Expect to SurviveFlopping Aces ^\r\n | 07-01-25\r\n | Vince\r\nPosted on 07/01/2025 7:13:04 AM PDT by Starman417\r\n… [+5951 chars]"
  },
  {
    "title": "Imidacloprid decreases energy production in the hemolymph and fat body of western honeybees even though, in sublethal doses, it increased the values of six of the nine compounds in the respiratory and citric cycle",
    "description": "Background Neonicotinoids, including imidacloprid (IM), cause harm to Apis mellifera in a number of ways, among others by impairing body maintenance, resistance and immunity. Energy resources are important to preventing this, as we hypothesized, not only in t…",
    "publishedAt": "2025-07-01T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0320168",
    "content": "Citation: Paleolog J, Wilde J, Gancarz M, Strachecka A (2025) Imidacloprid decreases energy production in the hemolymph and fat body of western honeybees even though, in sublethal doses, it increased… [+37806 chars]"
  },
  {
    "title": "Prevalence and antimicrobial resistance of Salmonella and pathogenic E. coli in broiler farms, Wakiso district, Uganda",
    "description": "Background The emergence and re-emergence of zoonotic bacterial infections and the upsurge reflected in current trends of antimicrobial-resistant bacteria is a major global concern. Salmonella spp and Escherichia coli (E. coli) are the two most important food…",
    "publishedAt": "2025-07-01T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309599",
    "content": "Citation: Ssemakadde T, Pauline Petra N, Busingye JC, Bazira J, Taseera K (2025) Prevalence and antimicrobial resistance of Salmonella and pathogenic E. coli in broiler farms, Wakiso district, Uganda… [+22796 chars]"
  },
  {
    "title": "The Sex-Workplace Novel Has Arrived",
    "description": "A noirish novel set in the world of strip clubs and BDSM dungeons ventures beyond titillation and into the daily grind.",
    "publishedAt": "2025-07-01T13:50:00Z",
    "source": "The Atlantic",
    "url": "https://www.theatlantic.com/books/archive/2025/07/sex-workplace-novel-has-arrived/683386/",
    "content": "Twenty years ago, a reader looking for taboo sex in print had to slink to the back of the bookstore and make whispered inquiries. Today, kinky books make up an established genre, one that shares fron… [+9458 chars]"
  },
  {
    "title": "Israel Cannot Invade Iran, But It Can Attempt An ‘Air Occupation’",
    "description": "Possible precedents for an Iran air occupation include Israel’s aerial dominance over the Gaza Strip and Lebanon and the U.S.-led no-fly zones over Saddam Hussein’s Iraq.",
    "publishedAt": "2025-07-01T13:23:26Z",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/pauliddon/2025/07/01/israel-cannot-invade-iran-but-it-can-attempt-an-air-occupation/",
    "content": "Israeli Air Force F-15 fighter jets en route to More\r\n Iran during Operation Rising Lion. (Israel Defense Forces handout photo published on June 25, 2025)Less\r\nIsrael Defense Force\r\nIsrael has expres… [+8397 chars]"
  },
  {
    "title": "From Roman drains to ancient filters, these artefacts show how solutions to water contamination have evolved",
    "description": "Having to protect and conserve drinking water and its sources is as relevant today as it always has been.",
    "publishedAt": "2025-07-01T13:10:27Z",
    "source": "The Conversation Africa",
    "url": "https://theconversation.com/from-roman-drains-to-ancient-filters-these-artefacts-show-how-solutions-to-water-contamination-have-evolved-253876",
    "content": "Thirst: In Search of Freshwater, an exhibition at Wellcome Collection. Benjamin Gilbert., CC BY-NC-ND\r\nA new exhibition in London (open until February 2026) called Thirst: In search of freshwater hig… [+5751 chars]"
  },
  {
    "title": "With Cappadocia Providing A Magical Backdrop, Turkish Series ‘Valley Of Hearts’ Is Finding New “Dizi” Fans All Around The World",
    "description": "Welcome to Global Breakouts, Deadline’s strand in which we shine a spotlight on the TV shows and films killing it in their local territories. Breakout hits are appearing in pockets of the world all the time and it can be hard to keep track. That’s why we’re d…",
    "publishedAt": "2025-07-01T13:00:00Z",
    "source": "Deadline",
    "url": "http://deadline.com/2025/07/valley-of-hearts-turkish-drama-international-yildiz-tunc-1236445703/",
    "content": "Welcome to Global Breakouts, Deadline’s strand in which we shine a spotlight on the TV shows and films killing it in their local territories. Breakout hits are appearing in pockets of the world all t… [+7389 chars]"
  },
  {
    "title": "How Middle East instability could influence African nations",
    "description": "Strategic interests link Israel and Iran to states across Africa. For now, Middle East instability is mostly felt indirectly but analysts fear greater threats for African nations should the Iran-Israel conflict escalate.",
    "publishedAt": "2025-07-01T12:04:00Z",
    "source": "DW (English)",
    "url": "https://www.dw.com/en/how-middle-east-instability-could-influence-african-nations/a-73089156",
    "content": "European analysts worry conflict in the Middle East could be a destabilizing factor in already volatile regions of the African continent.\r\n\"If the conflict between Israel and Iran escalates further, … [+4988 chars]"
  },
  {
    "title": "How Middle East conflicts could destabilize African nations",
    "description": "Strategic interests link Israel and Iran to African states. Analysts say threats loom for volatile African nations if the Iran-Israel confrontation escalates. European analysts worry that conflict in the Middle East could be a destabilizing factor in already …",
    "publishedAt": "2025-07-01T12:04:00Z",
    "source": "DW (English)",
    "url": "https://www.dw.com/en/israel-iran-war-africa-houthis-sahel-horn-of-africa/a-73089156",
    "content": "European analysts worry that conflict in the Middle East could be a destabilizing factor in already volatile regions of the African continent.\r\n\"If the conflict between Israel and Iran escalates furt… [+5040 chars]"
  },
  {
    "title": "How Middle East instability could rattle African nations",
    "description": "Strategic interests link Israel and Iran to African states. Analysts say threats loom for volatile African nations if the Iran-Israel conflict escalates. European analysts worry conflict in the Middle East could be a destabilizing factor in already volatile r…",
    "publishedAt": "2025-07-01T12:04:00Z",
    "source": "DW (English)",
    "url": "https://www.dw.com/en/how-middle-east-instability-could-rattle-african-nations/a-73089156",
    "content": "European analysts worry conflict in the Middle East could be a destabilizing factor in already volatile regions of the African continent.\r\n\"If the conflict between Israel and Iran escalates further, … [+4989 chars]"
  },
  {
    "title": "Scholarship is Not Merely Skepticism",
    "description": "Being appropriately skeptical is an important tool in the toolbox of the academic, but scholarship is not merely skepticism. I explain this in my latest article in The Bible and Interpretation, and thought that I should share it here so that subscribers to my…",
    "publishedAt": "2025-07-01T11:53:17Z",
    "source": "Patheos",
    "url": "https://www.patheos.com/blogs/religionprof/2025/07/scholarship-is-not-merely-skepticism.html",
    "content": "Being appropriately skeptical is an important tool in the toolbox of the academic, but scholarship is not merely skepticism. I explain this in my latest article in The Bible and Interpretation, and t… [+13938 chars]"
  },
  {
    "title": "Automotive Tire Pressure Monitoring System Market Set to Hit USD 8.94 Billion in 2024, Accelerating Ahead with a Robust 12.91% CAGR Through 2032 | AnalystView Market Insights",
    "description": "Automotive Tire Pressure Monitoring System Market, By Product Type (Direct and Indirect), By Vehicle Type, By Component, By Sales Channel, By Country, and By Region Global Industry Analysis, Market Size, Market Share & Forecast from 2025-2032 Automotive Tire …",
    "publishedAt": "2025-07-01T11:21:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108223/0/en/Automotive-Tire-Pressure-Monitoring-System-Market-Set-to-Hit-USD-8-94-Billion-in-2024-Accelerating-Ahead-with-a-Robust-12-91-CAGR-Through-2032-AnalystView-Market-Insights.html",
    "content": "San Francisco, USA, July 01, 2025 (GLOBE NEWSWIRE) -- Market Dynamics\r\nThe Automotive Tire Pressure Monitoring System (TPMS) market was valued at US$ 8,940.29 million in 2024 and is projected to grow… [+9667 chars]"
  },
  {
    "title": "Man accused of gathering information for Iran on Jews in Berlin arrested in Denmark, officials say",
    "description": "A man suspected of gathering information on Jewish locations and individuals in Berlin for Iranian intelligence, possibly with a view to carrying out attacks, has been arrested in Denmark, German prosecutors say. The Danish national, identified only as Ali S.…",
    "publishedAt": "2025-07-01T10:55:58Z",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-news/4326247/posts",
    "content": "Skip to comments.\r\nMan accused of gathering information for Iran on Jews in Berlin arrested in Denmark, officials sayTimes of Israel ^\r\n | 7/1/2025\r\n | Staff\r\nPosted on 07/01/2025 3:55:58 AM PDT by f… [+1743 chars]"
  },
  {
    "title": "India’s Turkey Travel Slumps in May Amid Diplomatic Backlash",
    "description": "Turkey is witnessing a repeat of what Maldives saw last year. As the world is opening up to Indians, travelers are now making choices that they think align with national interest, even if it means missing out on picture-perfect social media clicks.",
    "publishedAt": "2025-07-01T10:49:51Z",
    "source": "Skift",
    "url": "http://skift.com/2025/07/01/indias-turkey-travel-slumps-in-may-amid-diplomatic-backlash/",
    "content": "Indian arrivals to Turkey dropped nearly 24% in May this year compared to the same month last year. Provisional data from Turkeys Ministry of Tourism and Culture shows that the number of Indian visit… [+5076 chars]"
  },
  {
    "title": "Calendar",
    "description": "July\n\nDIS '25: ACM Designing Interactive Systems Conference (Funchal, Madeira)\nJuly 5–9, 2025\nhttps://dis.acm.org/2025/\nCUI '25: ACM Conversational User Interfaces Conference (Waterloo, Canada)\nJuly 8–10, 2025\nhttps://cui.acm.org/2025/\nCOMPASS '25 (Toronto, C…",
    "publishedAt": "2025-07-01T10:00:00Z",
    "source": "Acm.org",
    "url": "https://interactions.acm.org/archive/view/july-august-2025/calendar",
    "content": "Authors:INTR Staff \r\n July\r\nDIS '25: ACM Designing Interactive Systems Conference (Funchal, Madeira)July 5–9, 2025https://dis.acm.org/2025/\r\nCUI '25: ACM Conversational User Interfaces Conference (Wa… [+2224 chars]"
  },
  {
    "title": "Disney+ New Releases: July 2025",
    "description": "The three-episode season finale of Marvel’s Ironheart is the biggest release on Disney+ this month, premiering on July 1. After being expelled from MIT, genius inventor and tech prodigy Riri Williams (Dominique Thorne) struggles to find a way to still use her…",
    "publishedAt": "2025-07-01T10:00:00Z",
    "source": "Den of Geek US",
    "url": "http://www.denofgeek.com/tv/disney-new-releases-july-2025/",
    "content": "July 1Critter Fixers: Country Vets (S6, 12 episodes)Lost Treasures of Egypt (S5, 10 episodes)Ironheart (Episodes 4-6 at 6pm PT)\r\nJuly 2Miraculous Tales of Ladybug &amp; Cat Noir (S6, 8 episodes)ZOMBI… [+532 chars]"
  },
  {
    "title": "Travel Through Vast Lands and Play Classic Solitaire In Solitaire Time Warp",
    "description": "There's also a cat involved. What more do you need?\nThe post Travel Through Vast Lands and Play Classic Solitaire In Solitaire Time Warp appeared first on Droid Gamers.",
    "publishedAt": "2025-07-01T09:56:19Z",
    "source": "DroidGamers",
    "url": "https://www.droidgamers.com/news/travel-through-vast-lands-and-play-classic-solitaire-in-solitaire-time-warp/",
    "content": "Everybody knows solitaire. But Solitaire Time Warp is a brand-new mobile game that takes inspiration from the iconic card game, but with a fresh new twist. \r\nIt combines the gameplay that we all know… [+1938 chars]"
  },
  {
    "title": "Africa Data Center Portfolio Database 2025 | Almost 350 MW of Additional Power Capacity is Expected to Be Added by the End of 2025",
    "description": "Explore the in-depth analysis of Africa's evolving data center market with this comprehensive database. Covering 117 existing and 55 upcoming colocation data centers across 14 countries, including South Africa, Nigeria, and Morocco, this resource provides ins…",
    "publishedAt": "2025-07-01T09:49:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108152/28124/en/Africa-Data-Center-Portfolio-Database-2025-Almost-350-MW-of-Additional-Power-Capacity-is-Expected-to-Be-Added-by-the-End-of-2025.html",
    "content": "Dublin, July 01, 2025 (GLOBE NEWSWIRE) -- The \"Africa Existing &amp; Upcoming Data Center Portfolio\" database has been added to ResearchAndMarkets.com's offering.\r\nThis database presents analysis on … [+4572 chars]"
  },
  {
    "title": "Russia eyes Africa as major coal export market",
    "description": "Moscow has identified Africa as one of its major future coal export destinations Read Full Article at RT.com",
    "publishedAt": "2025-07-01T09:13:54Z",
    "source": "RT",
    "url": "https://www.rt.com/africa/620821-russia-eyes-africa-major-coal-export-destination/",
    "content": "Africa has the potential to become a major market for Russian coal exports and could rank third after China and India in terms of supply volumes, Russian Deputy Energy Minister Dmitry Islamov has sai… [+2248 chars]"
  },
  {
    "title": "Israeli officials to hold ceasefire talks in Washington amid military escalation in Gaza",
    "description": "Israeli forces intensified attacks in Gaza, targeting homes in the north and south, as a possible ceasefire was discussed in Washington. Thousands fled as Israeli tanks advanced into Gaza City, Khan Younis, and Rafah. Strikes reportedly killed at least 20 peo…",
    "publishedAt": "2025-07-01T09:04:32Z",
    "source": "The Times of India",
    "url": "https://economictimes.indiatimes.com/news/defence/israeli-officials-to-hold-ceasefire-talks-in-washington-amid-military-escalation-in-gaza/articleshow/122179326.cms",
    "content": "Israeli planes and tanks struck heavily in north and south Gaza on Tuesday, destroying clusters of homes, while Israeli Prime Minister Benjamin Netanyahu's confidant was in Washington, expected to di… [+2925 chars]"
  },
  {
    "title": "SOUEAST Officially Enters Morocco, Launching New Journey in North African Market",
    "description": "CASABLANCA, Morocco, July 01, 2025 (GLOBE NEWSWIRE) -- SOUEAST announced its official entry into the Morocco market, marking the launch of its North African strategy and a major breakthrough in its global expansion. It will offer EASE urban mobility experienc…",
    "publishedAt": "2025-07-01T09:00:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108121/0/en/SOUEAST-Officially-Enters-Morocco-Launching-New-Journey-in-North-African-Market.html",
    "content": "CASABLANCA, Morocco, July 01, 2025 (GLOBE NEWSWIRE) -- SOUEAST announced its official entry into the Morocco market, marking the launch of its North African strategy and a major breakthrough in its g… [+2553 chars]"
  },
  {
    "title": "Golden Generation Travel Market Trends, Opportunity, and Forecasts to 2030: Key Players Like Hilton and Airbnb Lead the Charge in Reinventing Senior-Oriented Travel Experiences",
    "description": "The Golden Generation Travel Market offers lucrative opportunities by catering to retirees with disposable income, seeking enriching, comfortable, and adventure-filled travel experiences. Providers can capitalize on wellness travel trends, offering accessible…",
    "publishedAt": "2025-07-01T08:20:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/07/01/3108103/28124/en/Golden-Generation-Travel-Market-Trends-Opportunity-and-Forecasts-to-2030-Key-Players-Like-Hilton-and-Airbnb-Lead-the-Charge-in-Reinventing-Senior-Oriented-Travel-Experiences.html",
    "content": "Dublin, July 01, 2025 (GLOBE NEWSWIRE) -- The \"Golden Generation Travel Market - Global Industry Size, Share, Trends, Opportunity, and Forecast, 2020-2030F\" has been added to ResearchAndMarkets.com's… [+6118 chars]"
  },
  {
    "title": "[INTERVIEW] G Adventures – ‘Born in Canada’ campaign",
    "description": "Happy Canada Day! Before we begin today's interview, I know we have not posted in a long while (Sept 2024). Since our 10 year anniversary, we have really scaled back on posting. That being said, you may have noticed our last 3 posts were interviews only. This…",
    "publishedAt": "2025-07-01T08:00:01Z",
    "source": "Pointshogger.com",
    "url": "https://pointshogger.com/interview-g-adventures-born-in-canada-campaign/",
    "content": "Happy Canada Day! Before we begin today’s interview, I know we have not posted in a long while (Sept 2024). Since our 10 year anniversary, we have really scaled back on posting. That being said, you … [+7762 chars]"
  },
  {
    "title": "Evidence of a 12,800-year-old shallow airburst depression in Louisiana",
    "description": "<p xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" class=\"first\" dir=\"auto\" id=\"d16462011e451\">We report evidence of a likely low-altitude cosmic airburst near Perkins, Louisiana,\n            associated with semi-consolidated deposits containing abundan…",
    "publishedAt": "2025-07-01T07:55:53Z",
    "source": "Scienceopen.com",
    "url": "https://www.scienceopen.com/hosted-document?doi=10.14293/ACI.2025.0004",
    "content": "<li>Kletetschka G, Takac M, Smrcinova L, Kavkova R, Abbott D, LeCompte MA, Moore CR, Kennett JP, Adedeji V, Witwer T, et al.. New Evidence of High-Temperature, High-Pressure Processes at the Site of … [+27577 chars]"
  },
  {
    "title": "Comparing Sandstorm Gold (NYSE:SAND) & Gold Reserve (OTCMKTS:GDRZF)",
    "description": "Sandstorm Gold (NYSE:SAND – Get Free Report) and Gold Reserve (OTCMKTS:GDRZF – Get Free Report) are both basic materials companies, but which is the better business? We will compare the two companies based on the strength of their earnings, risk, institutiona…",
    "publishedAt": "2025-07-01T07:25:00Z",
    "source": "ETF Daily News",
    "url": "https://www.etfdailynews.com/2025/07/01/comparing-sandstorm-gold-nysesand-gold-reserve-otcmktsgdrzf/",
    "content": "Sandstorm Gold (NYSE:SAND – Get Free Report) and Gold Reserve (OTCMKTS:GDRZF – Get Free Report) are both basic materials companies, but which is the better business? We will compare the two companies… [+4023 chars]"
  },
  {
    "title": "Boulder terror attack: Colorado woman, 82, injured by Molotov cocktail dies, charges upgraded",
    "description": "Colorado prosecutors on Monday upgraded the charges against the alleged Boulder terror suspect following the death of an 82-year-old woman who was injured by Molotov cocktails in the June 1 attack. The woman was identified in court documents as Karen Diamond.…",
    "publishedAt": "2025-07-01T07:19:50Z",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-chat/4326228/posts",
    "content": "Skip to comments.\r\nBoulder terror attack: Colorado woman, 82, injured by Molotov cocktail dies, charges upgradedFox News ^\r\n | 6/30/25\r\n | Danielle Wallace\r\nPosted on 07/01/2025 12:19:50 AM PDT by Li… [+3086 chars]"
  },
  {
    "title": "The Middle East’s End of Ideology",
    "description": "Across the region, transnational movements are giving way to a political model based on strong states.",
    "publishedAt": "2025-07-01T07:12:13Z",
    "source": "Foreign Policy",
    "url": "http://foreignpolicy.com/2025/07/01/middle-east-end-ideology-saudi-syria-uae-egypt-iran/",
    "content": "U.S. President Donald Trumps dramatic decision to bomb Iranian nuclear sites last weekend invited many a warning that the United States shouldnt stumble into Iran as it did with Iraq in 2003. But dur… [+11383 chars]"
  },
  {
    "title": "Refugees escaping Sudan face escalating hunger and malnutrition as food aid risks major reductions",
    "description": "The United Nations World Food Programme (WFP) today warned that millions of Sudanese refugees who have fled to neighbouring countries risk plunging deeper into hunger and malnutrition as critical funding shortages force drastic cuts to life saving food assist…",
    "publishedAt": "2025-07-01T06:47:44Z",
    "source": "Globalsecurity.org",
    "url": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250630-wfp01.htm",
    "content": "World Food Programme\r\n30 June 2025\r\nNAIROBI, Kenya -- The United Nations World Food Programme (WFP) today warned that millions of Sudanese refugees who have fled to neighbouring countries risk plungi… [+8841 chars]"
  },
  {
    "title": "Funding shortages threaten relief for millions of Sudanese refugees: WFP",
    "description": "Critical shortfalls in global humanitarian funding now threaten millions of Sudanese refugees fleeing war to seek refuge in neighbouring countries, the UN World Food Programme (WFP) said on Monday.",
    "publishedAt": "2025-07-01T06:47:12Z",
    "source": "Globalsecurity.org",
    "url": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250630-unnews03.htm",
    "content": "30 June 2025 - Critical shortfalls in global humanitarian funding now threaten millions of Sudanese refugees fleeing war to seek refuge in neighbouring countries, the UN World Food Programme (WFP) sa… [+1771 chars]"
  },
  {
    "title": "Top diplomat reaffirms France's determination to recognize State of Palestine",
    "description": "French Foreign Minister Jean-Noël Barrot has reaffirmed his country's \"determination to recognize the State of Palestine,\" underscoring the urgent need for international action in light of the worsening humanitarian situation in the besieged Gaza Strip.",
    "publishedAt": "2025-07-01T06:47:06Z",
    "source": "Globalsecurity.org",
    "url": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250630-presstv05.htm",
    "content": "Iran Press TV\r\nMonday, 30 June 2025 10:39 AM\r\nFrench Foreign Minister Jean-NoÃ«l Barrot has reaffirmed his country's \"determination to recognize the State of Palestine,\" underscoring the urgent need … [+2633 chars]"
  },
  {
    "title": "Trump demands an end to the war in Gaza – could a ceasefire be close?",
    "description": "Buoyed by the truce with Iran, President Trump is pushing for a ceasefire between Israel and Hamas. But it could entail unacceptable conditions for the Palestinians.",
    "publishedAt": "2025-07-01T06:40:22Z",
    "source": "The Conversation Africa",
    "url": "https://theconversation.com/trump-demands-an-end-to-the-war-in-gaza-could-a-ceasefire-be-close-260185",
    "content": "Anas-Mohammed/Shutterstock\r\nHopes are rising that Israel and Hamas could be inching closer to a ceasefire in the 20-month war in Gaza.\n\nUS President Donald Trump is urging progress, taking to social … [+6058 chars]"
  },
  {
    "title": "By miracle or by natural means?",
    "description": "Is it proper to recite a blessing on the military success in Iran? Is it  correct to define what happened there as a miracle?",
    "publishedAt": "2025-07-01T06:30:33Z",
    "source": "Israelnationalnews.com",
    "url": "https://www.israelnationalnews.com/news/410938",
    "content": "ShehecheyanuQ: Was it proper to bless Shehecheyanu or HaTov VeHametiv after Israels security forces succeeded in striking the top echelons of Irans military command, and also after the United States … [+11855 chars]"
  },
  {
    "title": "The Excuse of the “Iranian Nuclear Threat”",
    "description": "It is now widely accepted that Iraq's alleged possession of nuclear weapons was the excuse, not the reason, for the Israeli/American desire to destroy Iraq. It should also be obvious than Iran's alleged aspiration to develop and possess nuclear weapons is the…",
    "publishedAt": "2025-07-01T05:59:09Z",
    "source": "CounterPunch",
    "url": "https://www.counterpunch.org/?p=369329",
    "content": "An angry argument is currently raging over the extent of the damage inflicted on Iran’s nuclear capabilities by the American attacks on Iran’s three principal declared nuclear sites.\r\nWhile the argum… [+2360 chars]"
  },
  {
    "title": "The Irish Independent’s View: Netanyahu must be stopped, and only the US has the power to do it",
    "description": "Israel’s prime minister Benjamin Netanyahu has demonstrated how little he cares about international opprobrium.",
    "publishedAt": "2025-07-01T04:30:00Z",
    "source": "Independent.ie",
    "url": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-netanyahu-must-be-stopped-and-only-the-us-has-the-power-to-do-it/a1459839928.html",
    "content": "Israels prime minister Benjamin Netanyahu has demonstrated how little he cares about international opprobrium.With unlimited US assistance and unqualified permission, he has obliterated Gaza and atta… [+2687 chars]"
  },
  {
    "title": "Ibn Battuta, a 14th-century Judge and Ambassador, travelled further than Marco Polo. The Rihla records his Adventures",
    "description": "By Ismail Albayrak, Australian Catholic University In our guides to the classics, experts explain key literary works. (The Conversation) - Ibn Battuta, was born in Tangier, Morocco, on February 24, 1304. From a statement in his celebrated travel book the Rihl…",
    "publishedAt": "2025-07-01T04:06:31Z",
    "source": "Juancole.com",
    "url": "https://www.juancole.com/2025/07/ambassador-travelled-adventures.html",
    "content": "By Ismail Albayrak, Australian Catholic University\r\nIn our guides to the classics, experts explain key literary works.\r\n(The Conversation) – Ibn Battuta, was born in Tangier, Morocco, on February 24,… [+12147 chars]"
  },
  {
    "title": "The Moment I Knew God Was Speaking to Me",
    "description": "Pastor and Paws and Tails creator David Carl shares two defining moments from childhood that shaped his calling to tell stories about a God who loves deeply.",
    "publishedAt": "2025-07-01T04:00:00Z",
    "source": "Christianity.com",
    "url": "https://www.christianity.com/devotionals/i-am-a-christian/the-moment-i-knew-god-was-speaking-to-me.html",
    "content": "Welcome to Christianity.com. My name is David Carl. I'm a pastor, writer, and the creator of Paws and Tailsand Im a Christian. Here's why.\r\nMy first awareness of Gods love came when I was just four y… [+2256 chars]"
  },
  {
    "title": "How global conflicts are reshaping flight paths",
    "description": "Airlines are having to take longer and convoluted routes to avoid conflict zones",
    "publishedAt": "2025-07-01T01:17:08Z",
    "source": "The Week Magazine",
    "url": "https://theweek.com/culture-life/travel/how-global-conflicts-are-reshaping-flight-paths",
    "content": "Global conflicts are changing air travel. Since Russia invaded Ukraine in February 2022, commercial flights have been forced to divert around Ukraine, while most Western airlines have been banned fro… [+3512 chars]"
  },
  {
    "title": "Prime Minister Carney speaks with President of Egypt Abdel Fattah el-Sisi",
    "description": "Today, the Prime Minister, Mark Carney, spoke with the President of Egypt, Abdel Fattah el-Sisi.",
    "publishedAt": "2025-07-01T01:10:04Z",
    "source": "Globalsecurity.org",
    "url": "https://www.globalsecurity.org/wmd/library/news/canada/2025/canada-250630-canadapm01.htm",
    "content": "Prime Minister of Canada - Mark Carney\r\nJune 30, 2025Ottawa, Ontario\r\nToday, the Prime Minister, Mark Carney, spoke with the President of Egypt, Abdel Fattah el-Sisi.\r\nPrime Minister Carney and Presi… [+682 chars]"
  },
  {
    "title": "The Hoover Institution Briefing On National Security | May 2025",
    "description": "Welcome to the Hoover Institution’s briefing on national security. This month we are looking at the progression of drone technology using more sophisticated AI; Ukraine in dire need of a lifeline from the US and the EU; how America can effectively deter China…",
    "publishedAt": "2025-07-01T00:00:00Z",
    "source": "Hoover.org",
    "url": "https://www.hoover.org/news/hoover-institution-briefing-national-security-may-2025",
    "content": "Welcome to the Hoover Institutions briefing on national security. This month we are looking at the progression of drone technology using more sophisticated AI; Ukraine in dire need of a lifeline from… [+6705 chars]"
  },
  {
    "title": "Boosting Student Well-Being Over the Summer",
    "description": "Is summer the time to boost your child's well-being? Some psychology experts would say yes, and here are three ways to get you started.",
    "publishedAt": "2025-06-30T23:59:58Z",
    "source": "Psychology Today",
    "url": "https://www.psychologytoday.com/us/blog/creative-development/202506/boosting-student-well-being-over-the-summer",
    "content": "\"You cant stop the waves, but you can learn to surf\" Jon Kabat-Zinn\r\nFor many, summer is a time of resetting from the school year. It serves as the counterbalance to what one parent calls the enormou… [+2663 chars]"
  },
  {
    "title": "BRICS summit expected to denounce Pahalgam terror attack; call for fight against terrorism",
    "description": "NEW DELHI, June 30: The BRICS leaders’ declaration to be unveiled at the grouping’s annual summit in Rio de Janeiro is set to forcefully denounce the Pahalgam terror attack and call for a firm approach to unitedly confront terrorism in line with India’s expec…",
    "publishedAt": "2025-06-30T23:20:00Z",
    "source": "Thehillstimes.in",
    "url": "https://thehillstimes.in/national/brics-summit-expected-to-denounce-pahalgam-terror-attack-call-for-fight-against-terrorism",
    "content": "NEW DELHI, June 30: The BRICS leaders declaration to be unveiled at the groupings annual summit in Rio de Janeiro is set to forcefully denounce the Pahalgam terror attack and call for a firm approach… [+2951 chars]"
  },
  {
    "title": "Recent advances in the halogenated spirooxindoles as novel anticancer scaffolds: chemistry and bioactivity approach",
    "description": "RSC Adv., 2025, 15,22336-22375DOI: 10.1039/D5RA03404C, Review Article Open Access &nbsp This article is licensed under a Creative Commons Attribution-NonCommercial 3.0 Unported Licence.Mohamed S. Nafie, Ihab Shawish, Sherif Ashraf Fahmy, Mohamed K. Diab, Mari…",
    "publishedAt": "2025-06-30T23:00:00Z",
    "source": "Royal Society of Chemistry",
    "url": "https://pubs.rsc.org/en/content/articlelanding/2025/ra/d5ra03404c",
    "content": "* \r\n Corresponding authors\r\na\r\n Department of Chemistry, College of Sciences, University of Sharjah, Sharjah (27272), United Arab Emirates\r\nE-mail:mohamed.elsayed@sharjah.ac.ae, mohamed_nafie@science… [+1208 chars]"
  },
  {
    "title": "Israel pounds Gaza, killing 58, ahead of White House talks on ceasefire",
    "description": "Israeli strikes killed at least 58 people across Gaza on Monday as residents in the enclave's north reported one of the heaviest bombardments in weeks, while Israeli officials were due in Washington for a new ceasefire push by the Trump administration. A day …",
    "publishedAt": "2025-06-30T21:50:22Z",
    "source": "Japan Today",
    "url": "https://japantoday.com/category/world/israel-pounds-gaza-killing-58-ahead-of-white-house-talks-on-ceasefire",
    "content": "Israeli strikes killed at least 58 people across Gaza on Monday as residents in the enclave's north reported one of the heaviest bombardments in weeks, while Israeli officials were due in Washington … [+5022 chars]"
  },
  {
    "title": "Our Favorite Afropop Moments of 2025 So Far",
    "description": "Our favorite Afropop moments of 2025 so far: from Tems’ money moves to African stars rocking Coachella",
    "publishedAt": "2025-06-30T21:32:30Z",
    "source": "Rolling Stone",
    "url": "http://www.rollingstone.com/music/music-features/made-in-africa-best-moments-of-2025-so-far-1235375905/",
    "content": "We’re officially halfway through 2025, and it’s truly giving “It was the best of times, it was the worst of times.” This month’s column is going to lean into the good – a few Afropop moments of innov… [+8273 chars]"
  },
  {
    "title": "Bozdağ Film Platolari in İstanbul, Turkey",
    "description": "The hit television series \"Diriliş: Ertuğrul,\" (2014) and its sequel \"Kuruluş: Osman,\" (2019) are two of the most popular shows to come out of Turkey. The first is based on the life of historical figure Ertuğrul and the sequel tells the story of his son Osman…",
    "publishedAt": "2025-06-30T20:30:00Z",
    "source": "Atlas Obscura",
    "url": "https://www.atlasobscura.com/places/bozdag-film-platolari",
    "content": "The hit television series \"Dirili: Erturul,\" (2014) and its sequel \"Kurulu: Osman,\" (2019) are two of the most popular shows to come out of Turkey. The first is based on the life of historical figure… [+1485 chars]"
  },
  {
    "title": "The Fungus That May Have Caused The ‘Curse Of King Tut’s Tomb’ Just Showed Promising Results In Treating Cancer",
    "description": "Researchers at the University of Pennsylvania isolated select molecules from the fungus Aspergillus flavus and turned them into a \"cancer-killing compound that rivals FDA-approved drugs.\"\nThe post The Fungus That May Have Caused The ‘Curse Of King Tut’s Tomb’…",
    "publishedAt": "2025-06-30T19:45:37Z",
    "source": "Allthatsinteresting.com",
    "url": "https://allthatsinteresting.com/king-tut-curse-fungus-cancer-treatment",
    "content": "Researchers at the University of Pennsylvania isolated select molecules from the fungus Aspergillus flavus and turned them into a \"cancer-killing compound that rivals FDA-approved drugs.\"\r\nWikimedia … [+4591 chars]"
  },
  {
    "title": "Now It’s Murder: First Victim of Illegal Immigrant’s Molotov Attack on Jewish Group Dies",
    "description": "\"Investigators say Soliman told them he intended to kill the roughly 20 participants at the weekly demonstration on Boulder’s Pearl Street pedestrian mall.\"\nThe post Now It’s Murder: First Victim of Illegal Immigrant’s Molotov Attack on Jewish Group Dies firs…",
    "publishedAt": "2025-06-30T19:32:36Z",
    "source": "Legalinsurrection.com",
    "url": "https://legalinsurrection.com/2025/06/now-its-murder-first-victim-of-illegal-immigrants-molotov-attack-on-jewish-group-dies/",
    "content": "Karen Diamond, 81, has died “as a result of the severe injuries that she suffered” when Mohamed Sabry Soliman, an Egyptian national in the U.S. illegally, allegedly hurled Molotov cocktails at a grou… [+4384 chars]"
  },
  {
    "title": "Amazing Archaeological Discoveries (40 PICS)",
    "description": "Amazing Archaeological Discoveries  (40 PICS)",
    "publishedAt": "2025-06-30T18:53:35Z",
    "source": "Izismile.com",
    "url": "https://izismile.com/2025/06/30/amazing_archaeological_discoveries_40_pics.html",
    "content": "\"The Double Statue Of Mephistopheles And Margarita\"\r\n\"Perhaps one of the most incredible sculptures in the world. There is a well-known sculpture called \"The Double Statue of Mephistopheles and Marga… [+10766 chars]"
  },
  {
    "title": "82-Year-Old Jewish Woman Dies From Injuries Suffered in Anti-Semitic Colorado Terror Attack",
    "description": "An 82-year-old Jewish woman who suffered severe injuries during an anti-Semitic firebombing attack early June in Boulder, Colo., has died, prompting prosecutors to file first-degree murder and more hate crime charges on Monday against suspect Mohamed Soliman.…",
    "publishedAt": "2025-06-30T18:30:04Z",
    "source": "Washington Free Beacon",
    "url": "https://freebeacon.com/latest-news/82-year-old-jewish-woman-dies-from-injuries-suffered-in-anti-semitic-colorado-terror-attack/",
    "content": "An 82-year-old Jewish woman who suffered severe injuries during an anti-Semitic firebombing attack early June in Boulder, Colo., has died, prompting prosecutors to file first-degree murder and more h… [+2258 chars]"
  },
  {
    "title": "Amman’s Pitching Platforms Titles Catches the Range, Depth and Nuance of New Titles from Emerging Arab World Talent",
    "description": "Lina Soualem’s Spain-set family tale “Alicante,” “Asphalt,” the big winner at this year’s Cannes Docs-in-Progress, and “Printemps,” from Berlin laureates Noel and Michelle Keserwany, look like potential standouts at this year’s Amman Intl. Film Festival’s Pit…",
    "publishedAt": "2025-06-30T17:55:00Z",
    "source": "Variety",
    "url": "https://variety.com/2025/film/global/amman-film-festival-lina-soualem-1236443972/",
    "content": "Lina Soualem’s Spain-set family tale “Alicante,” “Asphalt,” the big winner at this year’s Cannes Docs-in-Progress, and “Printemps,” from Berlin laureates Noel and Michelle Keserwany, look like potent… [+13106 chars]"
  },
  {
    "title": "At least 58 killed as Israel intensifies offensive in Gaza",
    "description": "Despite hopes of a ceasefire between Israel and Hamas, the Israeli Defense Force stepped up its latest offensive in the Palestinian enclave on Monday.",
    "publishedAt": "2025-06-30T17:46:27Z",
    "source": "ABC News (AU)",
    "url": "https://www.abc.net.au/news/2025-07-01/israeli-bombardment-in-gaza-kills-58-people-in-one-day/105479464",
    "content": "A beachfront cafe and four schools were among the targets struck as Israel intensified its latest campaign against Hamas in Gaza, killing at least 58 people on Monday alone.\r\nThe strikes came as Isra… [+7017 chars]"
  },
  {
    "title": "A Story About Farting 2 – Ancient Egypt’s Gassy Apocalypse is Coming",
    "description": "Hey fellow gamers,We’re excited (and slightly horrified) to reveal our new project: A Story About Farting 2. If you thought the first game was absurd, you have no idea what’s coming.This time, the saga takes place in Ancient Egypt. You’ll step into the sandal…",
    "publishedAt": "2025-06-30T17:36:46Z",
    "source": "Gamedev.net",
    "url": "https://www.gamedev.net/blogs/entry/2295851-a-story-about-farting-2-ancient-egypts-gassy-apocalypse-is-coming",
    "content": "Hey fellow gamers,\r\nWere excited (and slightly horrified) to reveal our new project: A Story About Farting 2. If you thought the first game was absurd, you have no idea whats coming.\r\nThis time, the … [+1467 chars]"
  },
  {
    "title": "The 10 Most Stylish Handheld Fans to Look and Feel Cool This Summer",
    "description": "Our guide to stylish handheld fans, including the best folding fans trending on TikTok for keeping cool.",
    "publishedAt": "2025-06-30T17:10:45Z",
    "source": "WWD",
    "url": "http://wwd.com/shop/shop-fashion/best-handheld-fans-1237955595/",
    "content": "If you purchase an independently reviewed product or service through a link on our website, WWD may receive an affiliate commission.\r\nIf the heat wave that tore through the country last week proved a… [+10157 chars]"
  },
  {
    "title": "What’s Going On At HGTV? Another Series Got Canceled, And It’s The Fourth Time It’s Happened Recently",
    "description": "HGTV's lineup is lighter than it was a few weeks ago.",
    "publishedAt": "2025-06-30T16:57:24Z",
    "source": "CinemaBlend",
    "url": "https://www.cinemablend.com/television/fourth-hgtv-series-recently-canceled-farmhouse-fixer-jonathan-knight",
    "content": "It's safe to say that HGTV's lineup of original series looked very different when the 2025 TV premiere schedule started up, at least compared to how it looks now. The cable network has made several u… [+5415 chars]"
  },
  {
    "title": "Gabe's Reading List",
    "description": "I start tons of books using the Kindle preview but end up actually buying and finishing far fewer. I lean towards hard Sci-Fi. I like inscrutable alien artifacts and massive jumps through time. If I’m not reading about spaceships I’m reading history books for…",
    "publishedAt": "2025-06-30T16:55:00Z",
    "source": "Penny-arcade.com",
    "url": "https://www.penny-arcade.com/news/post/2025/06/30/gabe-s-reading-list",
    "content": "I start tons of books using the Kindle preview but end up actually buying and finishing far fewer. I lean towards hard Sci-Fi. I like inscrutable alien artifacts and massive jumps through time. If I’… [+1688 chars]"
  },
  {
    "title": "Scribble-based forecasting and AI 2027",
    "description": "math or intuition?",
    "publishedAt": "2025-06-30T16:15:29Z",
    "source": "Dynomight.net",
    "url": "https://dynomight.net/scribbles/",
    "content": "AI 2027 forecasts true AGI could plausibly arrive as early as 2027. I recently spent some time looking at both the timelines forecast and some critiques [1, 2, 3].\r\nInitially, I was interested in tec… [+11182 chars]"
  },
  {
    "title": "Israel kills 85 Palestinians, bombing across Gaza amid new ceasefire push",
    "description": "Homes, schools, hospitals and hungry aid seekers targeted by Israel as it forces thousands out of the enclave's north.",
    "publishedAt": "2025-06-30T16:12:59Z",
    "source": "Al Jazeera English",
    "url": "https://www.aljazeera.com/news/2025/6/30/israel-kills-85-palestinians-bombing-across-gaza-amid-new-ceasefire-push",
    "content": "Israeli forces have bombarded multiple areas across the besieged Gaza Strip, killing at least 85 Palestinians, including aid seekers and families sheltering in schools, and wounding many more in atta… [+5725 chars]"
  },
  {
    "title": "The gay Wimbledon tennis star turned spy who was imprisoned by the Nazis",
    "description": "As we prepare to be inundated with the strawberries and cream Instagram stories of Wimbledon, did you know the tennis tournament has a poignant place in gay history? Although you may be more familiar with the sport’s trailblazing gay Grand Slam champions Bill…",
    "publishedAt": "2025-06-30T16:07:08Z",
    "source": "Thepinknews.com",
    "url": "https://www.thepinknews.com/2025/06/30/gay-wimbledon-finalist-gottfried-von-cramm/",
    "content": "As we prepare to be inundated with the strawberries and cream Instagram stories of Wimbledon, did you know the tennis tournament has a poignant place in gay history?\r\nAlthough you may be more familia… [+3219 chars]"
  },
  {
    "title": "The Iran-Israel War Is Over. But the Arab World Is Grappling With Its Consequences",
    "description": "The region is relieved about de-escalation. But it is also alarmed about an unrestrained Israel, writes H.A. Hellyer.",
    "publishedAt": "2025-06-30T16:03:20Z",
    "source": "Time",
    "url": "https://time.com/7298676/iran-israel-conflict-arab-reaction/",
    "content": "The Iran-Israel ceasefire seems to be holding. Arab capitals are relieved about the de-escalation. But they are also alarmed about what the latest flare up means for the Middle East. \r\nWhen Iran sign… [+4040 chars]"
  },
  {
    "title": "More than 100 Items in the British Royal Regalia Symbolize Power and Tradition Through the Ages",
    "description": "What is the British Royal Regalia? Learn more about the British Crown Jewels and how they are replaced medieval renditions after anti-monarchists destroyed them.",
    "publishedAt": "2025-06-30T16:00:00Z",
    "source": "Discover Magazine",
    "url": "https://www.discovermagazine.com/the-sciences/more-than-100-items-in-the-british-royal-regalia-symbolize-power-and",
    "content": "Key Takeaways on the British Royal Regalia\r\n<ul><li>The British Royal Regalia signifies power and legitimacy of rulers. Worn at coronation ceremonies, the British Crown Jewels includes more than 100 … [+7430 chars]"
  },
  {
    "title": "Trump pressures Israel to end Gaza conflict as he eyes Abraham Accords expansion",
    "description": "Trump urges Israel to \"make the deal in Gaza\" as envoy Ron Dermer heads to White House meetings, while Israel claims Hamas blocks return of 50 hostages held since Oct. 7.",
    "publishedAt": "2025-06-30T15:55:58Z",
    "source": "Fox News",
    "url": "https://www.foxnews.com/world/trump-pressures-israel-end-gaza-conflict-he-eyes-abraham-accords-expansion",
    "content": "President Donald Trump is leaning on Israel to end its conflict in Gaza and secure a hostage deal as he looks to expand the Abraham Accords a cornerstone achievement of his first term.\r\nThe pressure … [+3168 chars]"
  },
  {
    "title": "Today in History: July 15, discovery of the Rosetta Stone",
    "description": "Today in History\nToday is Tuesday, July 15, the 196th day of 2024. There are 169 days left in the year.\nToday in History:\nOn July 15, 1799, the Rosetta Stone, a key to deciphering ancient Egyptian scripts, was found at Fort Julien in the Nile Delta during the…",
    "publishedAt": "2025-06-30T15:25:41Z",
    "source": "seattlepi.com",
    "url": "https://www.seattlepi.com/news/article/today-in-history-july-15-discovery-of-the-20400700.php",
    "content": "Today in History\r\nToday is Tuesday, July 15, the 196th day of 2024. There are 169 days left in the year.\r\nToday in History:\r\nAdvertisement\r\nArticle continues below this ad\r\nOn July 15, 1799, the Rose… [+3654 chars]"
  },
  {
    "title": "PM Oli holds bilateral meetings with Egyptian and Portuguese counterparts in Spain",
    "description": "KATHMANDU: Prime Minister KP Sharma Oli held separate bilateral meetings with the Prime Minister of Egypt, Dr. Mostafa Kamal Madbouly, and the Prime Minister of Portugal, Luís Montenegro, on the sidelines of the Fourth International Conference on Financing fo…",
    "publishedAt": "2025-06-30T15:14:49Z",
    "source": "Khabarhub.com",
    "url": "https://english.khabarhub.com/2025/30/481780/",
    "content": "KATHMANDU: Prime Minister KP Sharma Oli held separate bilateral meetings with the Prime Minister of Egypt, Dr. Mostafa Kamal Madbouly, and the Prime Minister of Portugal, Luís Montenegro, on the side… [+786 chars]"
  },
  {
    "title": "Jennifer Lopez Gearing Up to Launch Overseas Run of Up All Night Tour",
    "description": "Jennifer Lopez gearing up for July 8 launch of the overseas run of her Up All Night tour, slated to kick off with the first of seven shows in Spain.",
    "publishedAt": "2025-06-30T14:54:24Z",
    "source": "Billboard",
    "url": "http://www.billboard.com/music/pop/jennifer-lopez-dates-2025-up-all-night-overseas-tour-1236010451/",
    "content": "Jennifer Lopez is gearing up to keep her overseas fans Up All Night. The singer/actress took to her socials on Sunday (June 29) to hype the upcoming outing slated to hit Europe, the Middle East and C… [+2713 chars]"
  },
  {
    "title": "Air Cairo Sets New Benchmark for African Airlines: Enhances In-Flight Medical Safety with MedAire Partnership",
    "description": "Strategic Alliance with MedAire Aligns with Egypt's Vision for Modernised Aviation Safety and Healthcare Standards Strategic Alliance with MedAire Aligns with Egypt's Vision for Modernised Aviation Safety and Healthcare Standards",
    "publishedAt": "2025-06-30T14:38:00Z",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/06/30/3107660/0/en/Air-Cairo-Sets-New-Benchmark-for-African-Airlines-Enhances-In-Flight-Medical-Safety-with-MedAire-Partnership.html",
    "content": "Cairo, Egypt, June 30, 2025 (GLOBE NEWSWIRE) -- Air Cairo, one of Egypt's leading airlines, has partnered strategically with MedAire, the global leader in aviation medical and security support, to en… [+4570 chars]"
  },
  {
    "title": "Turkey-Libya Memorandum: Ankara’s influence over Libya’s warlords a double threat to Greece",
    "description": "Athens is preparing for a “dangerous mission” amid the volatile landscape in Libya, as developments regarding maritime zones and migration leave Greece no choice but to engage more directly with this crucial North African neighbor\nThe post Turkey-Libya Memora…",
    "publishedAt": "2025-06-30T14:28:54Z",
    "source": "Protothema.gr",
    "url": "https://en.protothema.gr/2025/06/30/turkey-libya-memorandum-ankaras-influence-over-libyas-warlords-a-double-threat-to-greece/",
    "content": "Over the weekend, beyond the harsh exchanges between Athens and Ankara over the Turkey-Libya Memorandum which the EU condemned as illegal negative signals also emerged from Eastern Libya. The Prime M… [+7127 chars]"
  },
  {
    "title": "Superior growth performance in carp fry achieved with chitosan-alginate encapsulated A-ghrelin versus free peptide: Evidence from physiological, molecular, and morphological analyses",
    "description": "This study investigates the potential of delivering ghrelin via chitosan-alginate (Cs-Al) nanocapsules to enhance growth performance, immune function, and stress biomarker parameters in common carp fry (Cyprinus carpio). Characterization of the nanoparticles …",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327235",
    "content": "Abstract\r\nThis study investigates the potential of delivering ghrelin via chitosan-alginate (Cs-Al) nanocapsules to enhance growth performance, immune function, and stress biomarker parameters in com… [+44523 chars]"
  },
  {
    "title": "Interpretable machine learning for predicting isolated basal septal hypertrophy",
    "description": "Background The basal septal hypertrophy(BSH) is an often under-recognized morphological change in the left ventricle. This is a common echocardiographic finding with a prevalence of approximately 7–20%, which may indicate early structural and functional remod…",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0325992",
    "content": "Citation: Gao L, Tian B, Jia Q, He X, Zhao G, Wang Y (2025) Interpretable machine learning for predicting isolated basal septal hypertrophy. PLoS One 20(6):\r\n e0325992.\r\nhttps://doi.org/10.1371/journ… [+25332 chars]"
  },
  {
    "title": "Closing The Strait Of Hormuz Will Be A Nightmare Scenario For The Global Economy",
    "description": "Our way of life depends on cheap energy.  If you remove cheap energy from the equation, our society will be thrown into a state of chaos.  The Iranians know that closing the Strait of Hormuz is one of the most powerful forms of leverage that they possess, bec…",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Activistpost.com",
    "url": "https://www.activistpost.com/closing-the-strait-of-hormuz-will-be-a-nightmare-scenario-for-the-global-economy/",
    "content": "Our way of life depends on cheap energy.  If you remove cheap energy from the equation, our society will be thrown into a state of chaos.  The Iranians know that closing the Strait of Hormuz is one o… [+8254 chars]"
  },
  {
    "title": "Here's Everything Coming to Disney+ Canada in July 2025",
    "description": "Schools are on summer vacation, and so is Disney+! The streamer has revealed its July 2025 lineup, and it includes a whole lotta nothing",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Exclaim!",
    "url": "https://exclaim.ca/film/article/here-s-everything-coming-to-disney-canada-in-july-2025",
    "content": "Schools are on summer vacation, and so is Disney+! The streamer has revealed its July 2025 lineup, and it includes a whole lotta nothing much.\r\nThis not-that-remarkable lineup includes the launch of … [+2832 chars]"
  },
  {
    "title": "Knowledge and attitudes towards Alzheimer’s disease among adult residents in Jiulongpo, Chongqing, China: A cross-sectional survey",
    "description": "Background The prevalence of Alzheimer’s disease (AD) continues to rise as the aging population increases, and the resulting cognitive decline severely affects patients’ quality of life. However, the public’s understanding of AD is markedly insufficient, whic…",
    "publishedAt": "2025-06-30T14:00:00Z",
    "source": "Plos.org",
    "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0327346",
    "content": "Abstract\r\nBackground\r\nThe prevalence of Alzheimers disease (AD) continues to rise as the aging population increases, and the resulting cognitive decline severely affects patients quality of life. How… [+34990 chars]"
  },
  {
    "title": "‘Sinners’ and ‘The Studio’ Among Nominations for Location Managers Guild International Awards",
    "description": "“Sinners,” “Conclave,” “The Day of the Jackal” and “The Studio” are among the movies and television shows nominated for the Location Managers Guild International awards. The 12th annual LMGI Awards are set for Aug. 23 and will be presented at The Eli and Edyt…",
    "publishedAt": "2025-06-30T13:30:00Z",
    "source": "Variety",
    "url": "https://variety.com/2025/artisans/news/location-managers-guild-international-awards-nominations-2025-1236443174/",
    "content": "“Sinners,” “Conclave,” “The Day of the Jackal” and “The Studio” are among the movies and television shows nominated for the Location Managers Guild International awards.\r\nThe 12th annual LMGI Awards … [+2700 chars]"
  },
  {
    "title": "Location Managers Guild Reveals 2025 LMGI Awards Nominations",
    "description": "The Location Managers Guild International is out with the nominations for its 12th LMGI Awards, which honor the outstanding and creative visual contributions by location professionals in film, TV and commercials worldwide. See the list below. The LMGI Awards …",
    "publishedAt": "2025-06-30T13:30:00Z",
    "source": "Deadline",
    "url": "http://deadline.com/2025/06/lmgi-awards-nominations-2025-list-1236444995/",
    "content": "The Location Managers Guild International is out with the nominations for its 12th LMGI Awards, which honor the outstanding and creative visual contributions by location professionals in film, TV and… [+2452 chars]"
  }
]